[
	{
		"author": "@20aman",
		"title": "Troubleshooting Azure Site Recovery (ASR) - Data Replication Not Working",
		"postDate": "14-11-2016",
		"tags": [
			"ASR",
			"Azure",
			"AzureSiteRecovery"
		],
		"category": "Azure",
		"body": "If you have the Azure Site Recovery (ASR) setup in your environment and are facing the issue where the data replication is stuck, then follow this blog to troubleshoot. The data replication can be stuck either during the initial replication or during the delta changes. This can occur for various reasons. We will inspect various components involved in ASR. Major of the troubleshooting is done on the Management Server i.e. the on-premise Configuration\/Master target server.\r\n\r\n### 1. Check Alerts Details ###\r\n\r\nGo to the Azure Site Recovery Vault and navigate to the settings. Click on the ***Alerts and Events***. Check the alerts for the data replication being blocked etc. Verify that the problem is related to data replication and not something else. \r\n\r\nYou can also navigate to the \"***Replicated Items***\" in the ASR Vault settings. On the blade for replicated items, click on the server for which the data is not being replicated. A new blade will open for this server's properties Then click on the Error Details on the server properties blade's context menu (which you can access by clicking on the top right ellipse i.e. 3 dots).\r\n\r\nAfter verifying the issue, proceed to next sections to troubleshoot.\r\n\r\n### 2. Check Resource Monitor ###\r\n\r\nCheck if you see any activity in the Resource Monitor. This is also to validate if the issue is there or not. Sometimes the **Low Bandwidth** and **multiple servers** configured against one Management server can cause this issue. Ensure that this is not the scenario in your case.\r\n\r\nFrom the Task manager, go to performance view and check for the bandwidth consumption. Then click on the \"Open Resource Monitor\" button to launch the Resource Monitor. From the CPU section in the Overview tab, select the below two services:\r\n\r\n - cxps.exe\r\n - cbengine.exe\r\n\r\nThen click on the Network tab and see if there is any traffic going out to Azure. If the data transfer is going on without issues then you should be able to view entries against cbengine going out to a URL which will look something like \"blob.aaa1aaa1aa.core.windows.net\" and entries against the csps service .\r\n\r\n![Resource Monitor](\/images\/1479242042582b713a13d26.png)\r\n\r\n### 3. Check ASR Infrastructure Setup ###\r\n\r\nFirst of all, check if the ASR infrastructure setup is correct and nothing is wrong there. To view this, navigate to the ASR Vault. Go to the settings and click on the \"Site Recovery Infrastructure\". In the next blade, click on the kind of infrastructure you have setup. E.g. If you are replicating from VMWare or Physical Machines from on-premise to Azure then click on the \"Configuration Servers\" under the \"For VMWare & Physical Machines\" section.\r\n\r\n![Site Recovery Infrastructure](\/images\/1479235374582b572e7bd28.png)\r\n\r\nHere check if the Config Server is showing as \"Connected\". If not then the problem is in the communication between Configuration Server and the Azure. Ensure that you are able to connect to the Azure portal from the config server. Also, ensure that all the public URLs for Azure are accessible. Check this link for exact URLs: [Verify URL Access](https:\/\/docs.microsoft.com\/en-us\/azure\/site-recovery\/site-recovery-best-practices#verify-url-access).\r\n\r\nNext, click on the configuration server. This will open another blade with details for the configuration server. Expand the section for \"Associated Servers\" as marked no. 2 in the screenshot below. Check if all the associated servers, i.e. Process Server, vCenter Server and Master Target servers are connected and showing green tick mark.\r\n\r\nNext, check the configuration server health as shown at no. 3 below. Check if all the services are running and showing healthy. Ensure that you have sufficient free space on the configuration server to send the replication data. If you see any services not running then go to the next section to check and start the services on the Management Server on-premise. \r\n\r\nYou can try refreshing the server after making any configuration changes on it, e.g. increasing memory or freeing up disk space. Click on the \"Refresh Server\" button as shown at no. 4, at the top of the blade for the configuration server.\r\n\r\n![Config Server Settings](\/images\/1479235804582b58dc26f55.png)\r\n\r\n### 4. Checking Services on the Management Server ###\r\n\r\nCheck if the services on the Management Server are up and running. You need to check for the below services:\r\n\r\n - InMage PushInstall\r\n - InMage Scout Application Service\r\n - InMage Scout VX Agent - Sentinel\/Outpost\r\n - INMAGE-AppScheduler\r\n - Microsoft Azure Recovery Services Agent\r\n - Microsoft Azure Site Recovery Service\r\n - cxprocessserver (This is important service. It is the service for the InMage CX Process Server)\r\n - tmansvc (This is the service for the InMage Volsync Thread Manager Service)\r\n\r\nStart any service which is not running and check if the problem still exists. 90% of the time the problem is going to be because of something related to these services (e.g. a restart or patch stopped one of these services).\r\n\r\n### 5. Checking Services on the Server being replicated ###\r\n\r\nCheck if the services on the Server being replicated are up and running. You need to check for the below services:\r\n\r\n - Azure Site Recovery VSS Provider\r\n - InMage Scout Application Service\r\n - InMage Scout VX Agent - Sentinel\/Outpost\r\n\r\nStart any service which is not running and check if the problem still exists.\r\n\r\n### 6. Verify Service Account credentials are correct and have required access ###\r\n\r\nThe replication can stop if the service account is not correct or it doesn't have required access. Check if the service account's password expired or changed. \r\n\r\nYou can use the Configuration Server config tool to check and update the service accounts. This tool can be accessed from this directory path: \"*D:\\Program Files (x86)\\Microsoft Azure Site Recovery\\home\\svsystems\\bin*\" where D is your install directory for ASR setup. The tool name under this directory is \"**cspsconfigtool.exe**\".\r\n\r\n![CSPS Config Tool](\/images\/1479238579582b63b3688bd.png)\r\n\r\n\r\n### 7. Check Logs ###\r\n\r\nThere are various ASR logs that gets generated in the Management server. Two key logs that you should check are as shown below. This assumes that D is the directory where ASR is installed.\r\n\r\n - **Monitoring Logs** - These logs are located at \"*D:\\Program Files (x86)\\Microsoft Azure Site Recovery\\home\\svsystems\\var*\". Name of the file you should check is \"**monitor_ps**\".\r\n - **VM-Specific ASR Logs** - These logs are located at \"*D:\\Program Files (x86)\\Microsoft Azure Site Recovery\\home\\svsystems*\". Then there will be a folder with the name as a GUID for each VM. Navigate to the folder with the Guid and try to find the folder for your VM's GUID. One indication will be the number of disks and the disk sizes. Once you have located the folder for one of the VM having replication problems. Then navigate to internal folders and locate the perf.log file for your VM's disks. Check to see if there are any errors here.\r\n\r\nThese logs should give you an idea as to what may have been causing the issues.\r\n\r\n### In Conclusion ###\r\nAfter all these steps and any changes you should Refresh the Configuration Server as shown in the point 3 above. \r\n\r\nLet me know if this blog helped in your scenario. ",
		"addpost": "addpost",
		"dated": "Nov 15, 2016",
		"slug": "troubleshooting-azure-site-recovery-asr-data-replication-not-working",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>If you have the Azure Site Recovery (ASR) setup in your environment and are facing the issue where the data replication is stuck, then follow this blog to troubleshoot. The data replication can be stuck either during the initial replication or during the delta changes. This can occur for various ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "General Availability - Azure Active Directory (AD) Domain Services",
		"postDate": "27-10-2016",
		"tags": [
			"AD",
			"ActiveDirectory",
			"Azure"
		],
		"category": "Azure",
		"body": "**Azure Active Directory Domain Services** are here to revolutionize the way Domain Services are used. They are here to reduce even further the infrastructure management for IT Administrators. \r\n\r\n###What is this service###\r\n\r\nUsing this service you can now setup domains without having to setup the domain controllers. You can set up your Domain in Azure using Domain Services and then you can have virtual machines joining to that domain. At no point, you need to set up any domain controllers. You can also use Group Policy with this service to securely administer your domain joined infrastructure.\r\n\r\nThis service benefits all customers. For **enterprise customers**, they get the familiar enterprise grade service. For **medium to small business customers**, the service makes even more sense as they get enterprise level service for a smaller price due to small infrastructure and thus a small number of objects in AD.\r\n\r\nThis service is out of the box a highly available service. It is hosted in globally distributed datacenters.\r\n\r\n### When is this service available ###\r\n\r\nThis service is now **Generally Available**. The pricing for this service will start from 1st December 2016.\r\n\r\nThe payment model is Pay-As-You-Go. The usage will be charged per hour. The chargeback will be based on the total number of AD Objects in your AD Tenant. These objects include users, groups, and domain-joined computers. Directory size and hours are calculated and emitted daily. Usage is prorated to the minute.\r\n\r\nCurrently, there are 3 tiers. \r\n\r\n - Less than 25,000 directory objects\r\n - 25,001 to 100,000 directory objects\r\n - more than 100,000 directory objects\r\n\r\n### Is this service available in my region###\r\n\r\nAt the time of writing of this blog post, this service is available in the following regions:\r\n\r\n - East US\r\n - East US 2\r\n - Central US\r\n - South Central US\r\n - West US\r\n\r\nCheck this link for most updated availability: [Azure Products by Region](https:\/\/azure.microsoft.com\/en-us\/regions\/services\/)\r\n\r\nAlso, check the official ADDS page here: [Azure Active Directory Domain Services](https:\/\/azure.microsoft.com\/en-us\/services\/active-directory-ds\/)\r\nAnd, check the upto date pricing here: [Pricing](https:\/\/azure.microsoft.com\/en-us\/pricing\/details\/active-directory-ds\/)\r\n\r\nNow it is time for you to go and try this new service for yourself and enjoy it's benefits!",
		"addpost": "addpost",
		"dated": "Oct 27, 2016",
		"slug": "general-availability-azure-active-directory-ad-domain-services",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Azure Active Directory Domain Services<\/strong> are here to revolutionize the way Domain Services are used. They are here to reduce even further the infrastructure management for IT Administrators. <\/p>\n<h3>What is this service<\/h3>\n<p>Using this service you can now setup domains without ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Suspending and Resuming Azure Site Recovery (ASR) Replication on a single or multiple servers",
		"postDate": "25-10-2016",
		"tags": [
			"ASR",
			"Azure",
			"AzureSiteRecovery"
		],
		"category": "Azure",
		"body": "Let us assume that you have enabled the Azure Site Recovery (ASR) replication on various servers. These servers can be:\r\n\r\n - On Premise VMWare VMs\r\n - On Premise Physical Servers\r\n - Azure ASM (older portal) VMs\r\n\r\nThe purpose could be anything from setting up Disaster Recovery for your infrastructure or using ASR for Migrating workloads from on-premise to Azure. For any reason, you may need to suspend and resume ASR replication on one or more target servers.\r\n\r\nCurrently, ASR does not have the feature to allow you to suspend and resume the ASR replication. But you can do this manually as easily. \r\n\r\nTo **Suspend** the ASR replication on a particular server, all you need to do is:\r\n\r\n 1. Log into the server on which ASR replication is currently going on and you want to suspend the replication.\r\n 2. Open the Services (Run -> services.msc)\r\n 3. Locate the following services and Stop these services.\r\n - Azure Site Recovery VSS Provider\r\n - InMage Scout Application Service\r\n - InMage Scout VX Agent - Sentinel\/Outpost\r\n\r\nCheckout these servers below:\r\n\r\n![Services 1](\/images\/1477354219580ea2eb7f4e6.png)\r\n\r\n![Services 2](\/images\/1477354229580ea2f52b728.png)\r\n\r\n\r\nTo **Resume** the ASR replication, just do the opposite, i.e. Log into the server and Start these services. \r\n\r\nUntil Azure adds this feature directly in the portal, this easy manual step is the workaround for suspending and resuming the replication on servers.",
		"addpost": "addpost",
		"dated": "Oct 25, 2016",
		"slug": "suspending-and-resuming-azure-site-recovery-asr-replication-on-a-single-or-multiple-servers",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Let us assume that you have enabled the Azure Site Recovery (ASR) replication on various servers. These servers can be:<\/p>\n<ul><li>On Premise VMWare VMs<\/li>\n<li>On Premise Physical Servers<\/li>\n<li>Azure ASM (older portal) VMs<\/li>\n<\/ul><p>The purpose could be anything from setting up Disaste...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Creating ASR Template from an existing Azure Infrastructure and Modifying It",
		"postDate": "19-10-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nThis blog post is for you if:\r\n\r\n - You want to backup an Infrastructure configuration\/setup in Azure and want to redeploy it to another environment then this blog is for you. \r\n - You want to create similar infrastructure as one of existing deployments in Azure\r\n - You want to modify the configurations of existing Azure IaaS infrastructure and redeploy various elements\r\n\r\n\r\nThis **Power Tip** is really easy if you know just the option. \r\n\r\n 1. If you want to make the template for all the resources in a Resource Group in Azure, then go to the properties of the Resource Group and find the option for \"**Automation Script**\".\r\n 2. If you want to get the template only for a particular resource, then navigate to that resource in the Azure Portal and then open it's settings. You will find the same \"**Automation Script**\" option. \r\n\r\nYou can check this option in the below screenshot.\r\n\r\n ![Automation Script](\/images\/1477349409580e902123ab1.png)\r\n\r\nOnce you click on the Automation Script option in the settings (of a resource group or a resource) then you will be presented with the complete JSON template along with the JSON outline on the right side (marked 2 above in the image).\r\n\r\nYou have various options for the actions to take on the template (marked 3 in the image above):\r\n\r\n - You can download the template\r\n - Add to Library to deploy the same resources again and again in your subscription\r\n - To directly deploy the resources again with the modifications you make. \r\n\r\nNormally, you would download the template to make edits to the same. After downloading, you should start cleaning up the template. There are only 4 major tasks that you need to perform as part of the cleanup:\r\n\r\n 1. Remove any **hard-coded values** for various dependent resources e.g. NIC for a VM, VHD for a VM etc.\r\n 2. Remove any resources and dependent parameters that you don't need.\r\n 3. Create **Parameters** for the values you want to change for each deployment and want the end user to provide during the deployment.\r\n 4. Create **Variables** for the values which can have fixed values but are being used at multiple locations in your template.\r\n\r\nThat's all there is to it. Using this tip you can spearhead your ARM Template developments. You don't need to start from scratch and can base your templates on the existing deployments.",
		"addpost": "addpost",
		"dated": "Oct 24, 2016",
		"slug": "step-by-step-arm-templates-creating-asr-template-from-an-existing-azure-infrastructure-and-modifying-it",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>This blog post is for you if:<\/p>\n<ul><l...><\/l...><\/ul>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step Azure Resource Manager (ARM) Templates - Index",
		"postDate": "15-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Azure Resource Manager (ARM) Template** is a JavaScript Object Notation (JSON) file that defines one or more resources to deploy to a resource group. It also defines the dependencies between the deployed resources. The template can be used to deploy the resources consistently and repeatedly.\r\n\r\nARM Templates can be used for the deployment of resources on both Azure and Azure Stack. Using these templates for all deployments provides you with various **benefits** including:\r\n \r\n - **Declarative Deployment** – All you need to do is declare what you need to deploy. You don't need to create any complex rules or write lengthy scripts.\r\n - **Idempotency** – You can deploy the same template over and over again without affecting the current resources.\r\n - **Predictability** - Using Templates you can have accurate predictability when performing large deployments. You reduce any manual errors.\r\n - **Repitition without Errors** - You can deploy the same infrastructure over and over again (e.g. in Dev-test environments and then in production).\r\n\r\nThis series of posts try to decode and understand the ARM Templates \"Step By Step\".\r\n\r\nThis post is an index of all the posts, in sequence, for understanding the Azure Resource Manager (ARM) Templates. This post will be updated regularly as more posts on this topic are added.\r\n\r\n 1. [Index](#) \r\n 2. [JSON 101 for IT Administrators](\/post\/step-by-step-arm-templates-json-101-for-it-administrators\/)\r\n 3. [What is in an ARM Template - Understanding All Components](\/post\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-all-components\/)\r\n 4. [What is in an ARM Template - Understanding Components 2 - Parameters](\/post\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-2-parameters\/)\r\n 5. [What is in an ARM Template - Understanding Components 3 - Variables](\/post\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-3-variables\/)\r\n 6. [What is in an ARM Template - Understanding Components 4 - Resources](\/post\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-4-resources\/)\r\n 7. [What is in an ARM Template - Understanding Components 5 - Outputs](\/post\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-5-outputs\/)\r\n 8. [Helper Functions in ARM Templates](\/post\/step-by-step-arm-templates-helper-functions\/)\r\n 9. [Building your first ARM Template](\/post\/step-by-step-arm-templates-building-your-first-arm-template\/)\r\n 10. [Deploying Template Using Azure Portal](\/post\/step-by-step-arm-templates-deploying-template-using-azure-portal\/)\r\n 11. [Deploying Template Using Azure PowerShell](\/post\/step-by-step-arm-templates-deploying-template-using-azure-powershell\/)\r\n 12. [Creating Parameters file for an ARM Template](\/post\/step-by-step-arm-templates-creating-parameters-file-for-an-arm-template\/)\r\n 13. [Authoring ARM Templates using Visual Studio](\/post\/step-by-step-arm-templates-authoring-arm-templates-using-visual-studio\/)\r\n 14. [Deploying ARM Templates using Visual Studio](\/post\/step-by-step-arm-templates-deploying-arm-templates-using-visual-studio\/)\r\n 15. [Iterating and creating multiple instances of a resource](\/post\/step-by-step-arm-templates-iterating-and-creating-multiple-instances-of-a-resource\/)\r\n 16. [Visualizing ARM Templates and Generating Diagrams](\/post\/step-by-step-arm-templates-visualizing-arm-templates-and-generating-diagrams\/)\r\n 17. [Using Key Vault to Securely Provide Information in ARM Templates](\/post\/step-by-step-arm-templates-using-key-vault-to-securely-provide-information-in-arm-templates\/)\r\n 18. [Providing PowerShell Scripts to Run after VM deployment via ARM Template](\/post\/step-by-step-arm-templates-providing-powershell-scripts-to-run-after-vm-deployment-via-arm-template\/)\r\n 19. [Deploying a Windows VM with OMS integration](\/post\/step-by-step-arm-templates-deploying-a-windows-vm-with-oms-integration\/)\r\n 20. [Creating ASR Template from an existing Azure Infrastructure and Modifying It](\/post\/step-by-step-arm-templates-creating-asr-template-from-an-existing-azure-infrastructure-and-modifying-it\/)",
		"savedraft": "savedraft",
		"dated": "Oct 21, 2016",
		"slug": "step-by-step-azure-resource-manager-arm-templates-index",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Azure Resource Manager (ARM) Template<\/strong> is a JavaScript Object Notation (JSON) file that defines one or more resources to deploy to a resource group. It also defines the dependencies between the deployed resources. The template can be used to deploy the resources consistently and r...<\/p>\n",
		"addpost": "addpost",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Providing PowerShell Scripts to Run after VM deployment via ARM Template",
		"postDate": "19-10-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"PowerShell",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nBy providing PowerShell Scripts to Run after VM deployment via ARM Template, you can accomplish various activities. \r\n\r\n - You can setup different features and roles on the VM. \r\n - You can setup web server. \r\n - You can setup SQL Database and configure it.\r\n - You can configure custom policies\r\n - And so on...\r\n\r\nYou first need to have PowerShell script files uploaded to a storage account.\r\nTo do this you add an **Extension resource** (*Microsoft.Compute\/virtualMachines\/extensions*) nested inside a VM. This extension resource should be of type \"**CustomScriptExtension**\". You provide the URLs to the PowerShell scripts inside this custom script extension.\r\n\r\n### Preparation ###\r\n\r\nAs part of the preparation process you need to:\r\n\r\n - Ensure that the PowerShell scripts are uploaded to the Storage Account and that you have the complete URL to the blob. \r\n - Or you can upload the scripts to the GitHub and get the Raw file URL\r\n - If there are more than one scripts then there should be one master script amongst all ps1 files which will internally invoke other files. This master file will be triggered via the template. Information of all file URLs will also be provided via the Template\r\n\r\n### Providing and configuring Scripts to Run After VM Deployment ###\r\n\r\nDefine the below resource to provide PowerShell scripts to be run after VM deployment:\r\n\r\n    {\r\n       \"type\": \"Microsoft.Compute\/virtualMachines\/extensions\",\r\n       \"name\": \"MyCustomScriptExtension\",\r\n       \"apiVersion\": \"2015-05-01-preview\",\r\n       \"location\": \"[parameters('location')]\",\r\n       \"dependsOn\": [\r\n           \"[concat('Microsoft.Compute\/virtualMachines\/',parameters('vmName'))]\"\r\n       ],\r\n       \"properties\": {\r\n           \"publisher\": \"Microsoft.Compute\",\r\n           \"type\": \"CustomScriptExtension\",\r\n           \"typeHandlerVersion\": \"1.7\",\r\n           \"autoUpgradeMinorVersion\":true,\r\n           \"settings\": {\r\n               \"fileUris\": [\r\n               \"http:\/\/Yourstorageaccount.blob.core.windows.net\/customscriptfiles\/start.ps1\",\r\n               \"http:\/\/Yourstorageaccount.blob.core.windows.net\/customscriptfiles\/secondaryScript.ps1\",\r\n\r\n           ],\r\n           \"commandToExecute\": \"powershell.exe -ExecutionPolicy Unrestricted -File start.ps1\"\r\n         }\r\n       }\r\n     }\r\n\r\n**How it works:**\r\n\r\n - Both the files i.e. start.ps1 and secondaryScript.ps1 are picked up from the storage account after VM deployment. Ensure to replace the URLs with your actual storage account blob URLs. You can add more files if needed.\r\n - The \"start.ps1\" is the main powerShell script which should be invoking the secondaryScript.ps1 internally\r\n - CommandToExecutre property is used to invoke the start.ps1 powerShell script on the deployed VM\r\n\r\n### Passing Parameters to the PowerShell Script dynamically ###\r\n\r\nTo pass the parameters to the PowerShell script use commandToExecute property. \r\n\r\nOne such example to pass the parameters is shown below:\r\n\r\n    \"commandToExecute\": \"[concat('powershell.exe -ExecutionPolicy Unrestricted -File start.ps1', ' -domainName ', parameters('domainNameParameter')]\"\r\n\r\nNote the use of \"concat\" helper function to create the value of the \"commandToExecute\". Also note that there is starting and trailing space in the second argument of the concat i.e. \" -domainName \".\r\n\r\nThe parameter \"domainNameParameter\" should already be defined in the template in the parameters section. If the value of parameter \"domainNameParameter\" is \"testdomain.com\" then the dynamically generated command will become:\r\n\r\n    powershell.exe -ExecutionPolicy Unrestricted -File start.ps1 -domainName testdomain.com\r\n\r\n### Securing the Access to the PowerShell Script File in Storage account ###\r\n\r\nLet us assume you want to deploy Windows VM with Protected settings. Then use the below sample to provide the PowerShell files.\r\n\r\n    {\r\n        \"publisher\": \"Microsoft.Compute\",\r\n        \"type\": \"CustomScriptExtension\",\r\n        \"typeHandlerVersion\": \"1.7\",\r\n        \"settings\": {\r\n            \"fileUris\": [\r\n                \"http: \/\/Yourstorageaccount.blob.core.windows.net\/customscriptfiles\/start.ps1\"\r\n            ]\r\n        },\r\n        \"protectedSettings\": {\r\n            \"commandToExecute\": \"powershell.exe -ExecutionPolicy Unrestricted -start.ps1\",\r\n            \"storageAccountName\": \"yourStorageAccountName\",\r\n            \"storageAccountKey\": \"yourStorageAccountKey\"\r\n        }\r\n    }\r\n\r\nNote the use of \"protectedSettings\" above. This time you also specify the Storage Account Name and the Storage Account Key.\r\n\r\nYou can also refer the official documentation here: [Windows VM Custom Script extensions with Azure Resource Manager templates](https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/virtual-machines-windows-extensions-customscript\/).",
		"addpost": "addpost",
		"dated": "Oct 19, 2016",
		"slug": "step-by-step-arm-templates-providing-powershell-scripts-to-run-after-vm-deployment-via-arm-template",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>By providing PowerShell Scripts to Run af...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Using Key Vault to Securely Provide Information in ARM Templates",
		"postDate": "18-10-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"KeyVault",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nWhen providing passwords and other secure and confidential information in ARM Templates, you need to ensure that you don't hard code these values anywhere. You don't need to compromise the security of the system while trying to automate deployments. Your end goal is to try to automate as much as possible and reduce manual involvement. \r\n\r\n**Key Vaults** are there to solve this problem without compromising any security. In fact, they make the whole solution more secure with least manual intervention.\r\n\r\n### Setting up the Key Vault ###\r\n\r\nWe first need to setup the Key Vault in Azure to be able to use it via ARM Template parameters.\r\n\r\n<ol>\r\n    <li>\r\n<b>Create a Key Vault in Azure<\/b> by going to <i>New -> Security + Identity -> Key Vault<\/i>. Provide a name, subscription, resource group etc. and provision the Key Vault. Once it is created navigate to it by clicking on \"More Services\" and searching for Key Vault. Click on the name of the vault you created. E.g. In this example we have named the key vault to \"TestKeyVault101\".\r\n\r\n<br \/>\r\n<b>Note<\/b> that this feature is in Preview  at the time of writing of this blog.\r\n\r\n    <\/li>\r\n\r\n    <li>\r\n        Next, we need to <b>Add a Secret<\/b> in the key vault. Click on the Secrets and then the + Add button at the top, as shown below:\r\n<br \/><br \/>\r\n<img alt=\"Adding Secret\" src=\"\/images\/1476818644580676d447b16.png\" \/>\r\n<br \/><br \/>\r\nNext, in the \"Create a secret\" blade, set the Upload Options to Manual. Provide a name and value to the secret. Value is the password you want to securely save.\r\nEnsure that the Enabled is set to Yes. Optionally you can set the activation and expiration dates. In this example, we are setting the Secret Name to \"DefaultAdminPasswordSecret\".\r\n<br \/><br \/>\r\n<img alt=\"Creating Secret\" src=\"\/images\/1476818650580676da89fee.png\" \/>\r\n    <\/li>\r\n\r\n    <li>\r\n        Next, we will set the <b>Access Policies <\/b> to provide access to the user under the context of which the template will be deployed. This is the user which will be accessing the Key Vault. Go to Key Vault settings and select Access Policies. Add the new user as shown below:\r\n<br \/><br \/>\r\n<img alt=\"Access Policies\" src=\"\/images\/14768190995806789bad0c4.png\" \/>\r\n<br \/><br \/>\r\n\r\n    <\/li>\r\n\r\n    <li>\r\n        Next, we will set the <b>Advanced Access Policies <\/b> to indicate that this key vault can be accessed via ARM Templates. Go to Key Vault settings and select Advanced Access Policies. Ensure that the checkbox for \"<i>Enable access to Azure Resource Manager for template deployment<\/i>\" is checked as shown below:\r\n<br \/><br \/>\r\n<img alt=\"Access Policies\" src=\"\/images\/1476819105580678a1cfc9f.png\" \/>\r\n<br \/> <br \/>\r\n\r\n    <\/li>\r\n\r\n<\/ol>\r\n\r\nWe are now all set with our Key Vault. Next, we will be using the secret we created to set the local Administrator user's password.\r\n\r\n### Using the Key Vault Secret in ARM Template ###\r\n\r\nLet us assume that you have a JSON ARM Template which deploys a VM. One of the parameters in this template is AdminPassword. You want to use the Key Vault Secret to provide the value for this parameter. \r\n\r\n\r\n\r\n\r\n**First**, ensure that the parameter is declared as <i>securestring<\/i> as shown below:\r\n\r\n    \"adminPassword\": {\r\n        \"type\": \"securestring\",\r\n        \"metadata\": {\r\n            \"description\": \"Password for local admin account.\"\r\n        }\r\n    }\r\n\r\n**Next**, we need to use the parameters file for this template. If you don't have one already create a new one. We can provide the reference to the Key Vault Secret as the value of admin user's password parameter in this file. General Syntax of providing reference is as shown follow:\r\n\r\n    \"adminPassword\": {\r\n      \"reference\": {\r\n        \"keyVault\": {\r\n          \"id\": \"Key Vault Id Here\"\r\n        },\r\n        \"secretName\": \"Name of the secret in Azure Key Vault\"\r\n      }\r\n    }\r\n\r\nNow the ID in the above Syntax can be provided as:\r\n\r\n*\/subscriptions\/{guid}\/resourceGroups\/{group-name}\/providers\/Microsoft.KeyVault\/vaults\/{vault-name}*. \r\n\r\nNote to replace the *{guid}* with actual GUID for the subscription (without the curly braces), replace *{group-name}* with the actual name of the resource group and *{vault-name}* with the actual name of the Key Vault.\r\n\r\nYou can also find the Resource ID for the Key Vault by navigating to it in the Azure Portal and then checking it's properties as shown below:\r\n\r\n![Key Vault Resource ID](\/images\/147682308858068830f2f8e.png)\r\n\r\nThe complete parameter file looks like below:\r\n\r\n    {\r\n      \"$schema\": \"http:\/\/schema.management.azure.com\/schemas\/2015-01-01\/deploymentParameters.json#\",\r\n      \"contentVersion\": \"1.0.0.0\",\r\n      \"parameters\": {\r\n        \"OtherParameter\": {\r\n          \"value\": \"otherValue\"\r\n        },\r\n        \"adminPassword\": {\r\n          \"reference\": {\r\n            \"keyVault\": {\r\n              \"id\": \"\/subscriptions\/11111aaa-1a11-1a11-a1aa-1a1111a111a1\/resourceGroups\/TestRG101\/providers\/Microsoft.KeyVault\/vaults\/TestKeyVault101\"\r\n            },\r\n            \"secretName\": \"DefaultAdminPasswordSecret\"\r\n          }\r\n        }\r\n      }\r\n    }\r\n\r\nNext, deploy the template using PowerShell and pass this parameters file as explained here: [Deploying Template Using Azure PowerShell](\/post\/step-by-step-arm-templates-deploying-template-using-azure-powershell\/). \r\n\r\nExample PowerShell cmdlet to deploy will look like:\r\n\r\n    New-AzureRmResourceGroupDeployment -Name ExampleDeployment -ResourceGroupName TestResourceGroup01 -TemplateFile .\\TemplateFile.json -TemplateParameterFile .\\ParametersFile.json\r\n\r\nNow that you know how to use values from Key Vaults, you can make the automated deployment of resources more secure in your environment.",
		"addpost": "addpost",
		"dated": "Oct 18, 2016",
		"slug": "step-by-step-arm-templates-using-key-vault-to-securely-provide-information-in-arm-templates",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>When providing passwords and other secure...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Visualizing ARM Templates and Generating Diagrams",
		"postDate": "17-10-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nWhen developing ARM Templates, from time to time you will need to:\r\n\r\n - Visualize your ARM Templates\r\n - Generate Diagrams for your ARM Templates\r\n\r\nMicrosoft has provided an Open Source tool for this named \"ARMVIZ\" (short for ARM Visualizer). This tool can be accessed by navigating to the below URL:\r\n\r\n[http:\/\/armviz.io\/](http:\/\/armviz.io\/)\r\n\r\n\r\n### Navigating ARMVIZ ###\r\n\r\nARMVIZ is a nice in-browser application to visualize all the components in a template. It also shows the dependencies between various components. Using this web application you can:\r\n\r\n - Either visualize your own developed template,\r\n - Or inspect existing templates on GitHub\r\n\r\nLet's take a quick tour of the interface:\r\n\r\n![ARMVIZ Interface](\/images\/14768067785806487ad77dd.png)\r\n\r\nI have numbered various elements of the interface in the above diagram. Let's quickly review these elements:\r\n\r\n<ol>\r\n\r\n    <li>\r\n              <b>Designer<\/b> - This is represented by an \"eye\" icon on the left bar. This should be selected by default. If you are in the editor mode then you can click this and the diagram will be shown in the middle portion of the screen.\r\n    <\/li>\r\n\r\n    <li>\r\n              <b>Editor<\/b> - This is represented by \"<\/>\" text for code on the left bar. Clicking on this will take you to the editor portion of the ARMVIZ tool. In this area, you can edit your template while still in the tool. You can add or remove components. You can even edit the components or add dependencies.\r\n    <\/li>\r\n\r\n     <li>\r\n              <b>Canvas area<\/b> - This is the main screen (the middle area) where the template is displayed.\r\n    <\/li>\r\n\r\n    <li>\r\n              <b>File Menu<\/b> - This is the main and simple menu in the whole web application in the top bar. It has two options:\r\n              <ol type=\"a\">\r\n                       <li>\r\n                             <b>Open Local Template<\/b> - You can open an ARM Template JSON from your local computer to visualize using this menu option.\r\n                       <\/li>\r\n                       <li>\r\n                             <b>Download Template<\/b> - You can download the current template by using this menu option.\r\n                       <\/li>\r\n              <\/ol>\r\n    <\/li>\r\n\r\n    <li>\r\n              <b>Quickstart ARM Templates<\/b> - This is the link to external library of Quickstart ARM Templates on GitHub. These starter templates can help you save a lot of time. Instead of starting from scratch you can use these templates to fasten the ARM Templates Development.\r\n    <\/li>\r\n\r\n<\/ol>\r\n\r\nThis is how the Editor portion of the tool looks like. Use this area to edit or update your template. \r\n**Note:** If there will be mistakes, such as missing parenthesis in your template, the designer will not show any diagram. \r\n\r\n![Editor Area](\/images\/147680732358064a9ba1310.png)\r\n\r\nYou can zoom into and zoom out of your template diagram by rolling the mouse wheel. You can also drag and reposition various elements. \r\nTake a screenshot once you have repositioned the elements as per your requirements and have zoomed into an appropriate level.\r\n\r\nBelow screenshot is taken from a much more complex template.\r\n\r\n![Complex ARM Template Diagram](\/images\/1476806791580648877fed3.png)\r\n\r\nIn conclusion, ARMVIZ can enable you to easily visualize your ARM Templates. It can empower you to generate diagrams for your documentation and to present to your team.",
		"addpost": "addpost",
		"dated": "Oct 17, 2016",
		"slug": "step-by-step-arm-templates-visualizing-arm-templates-and-generating-diagrams",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>When developing ARM Templates, from time ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Deploying a Windows VM with OMS integration",
		"postDate": "16-10-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nYou can deploy a Windows VM with OMS integration. You can have the OMS extension installed. And then you can onboard the VM to a specified workspace. \r\n\r\n### Prerequisites ###\r\n\r\nYou need already have an OMS workspace setup in your subscription. You need to have the following information about this OMS Workspace:\r\n\r\n 1. OMS workspace ID\r\n 2. OMS workspace Key\r\n\r\nYou may obtain the workspace ID and key by going to the Connected Sources tab in the Settings page in the OMS Portal or to the Direct Agent blade in the Azure portal.\r\n\r\nIn the Azure Portal go to the Log Analytics -> Click on the OMS Workspace you want to use. Click on the \"OMS Portal\" to navigate to the OMS Portal.\r\n\r\n![Link to OMS Portal](\/images\/14768464545806e3762d97c.png)\r\n\r\nIn the OMS portal, navigate to the Settings.\r\n\r\n![OMS Portal Settings](\/images\/14768422705806d31e60125.png)\r\n\r\nIn Settings, go to the Connected Sources -> Windows Servers. Note the Workspace ID and the Primary Key as shown below:\r\n\r\n![OMS Portal ID and Key](\/images\/14768422755806d323b2caa.png)\r\n\r\n### ARM Template Sections for OMS integration ###\r\n\r\nWithin the VM resource, you need to define the OMS extension as shown below:\r\n\r\n      \"resources\": [\r\n        {\r\n          \"type\": \"extensions\",\r\n          \"name\": \"Microsoft.EnterpriseCloud.Monitoring\",\r\n          \"apiVersion\": \"[variables('apiVersion')]\",\r\n          \"location\": \"[resourceGroup().location]\",\r\n          \"dependsOn\": [\r\n            \"[concat('Microsoft.Compute\/virtualMachines\/', variables('vmName'))]\"\r\n          ],\r\n          \"properties\": {\r\n            \"publisher\": \"Microsoft.EnterpriseCloud.Monitoring\",\r\n            \"type\": \"MicrosoftMonitoringAgent\",\r\n            \"typeHandlerVersion\": \"1.0\",\r\n            \"autoUpgradeMinorVersion\": true,\r\n            \"settings\": {\r\n              \"workspaceId\": \"Your Workspace ID Here\"\r\n            },\r\n            \"protectedSettings\": {\r\n              \"workspaceKey\": \"Your Workspace Key Here\"\r\n            }\r\n          }\r\n        }\r\n      ]\r\n\r\nThe above configures the OMS on the VM. Note that you need the nested extension resource of type \"Microsoft.EnterpriseCloud.Monitoring\". \r\n\r\nAlso, note the Workspace Id and Key in the template section above. Enter the values as per your environment which we found in the Prerequisites section above. \r\n\r\n### Providing the Workspace ID and Workspace Key Dynamically ###\r\n\r\nYou can also provide the Workspace Id and the Workspace Key dynamically by only using the OMS Workspace name. Follow the below sample. Note the use of reference, listKeys, and resourceId helper functions.\r\n\r\n    \"settings\": {\r\n              \"workspaceId\": \"[reference(resourceId('Microsoft.OperationalInsights\/workspaces\/', parameters('workspaceName')), '2015-03-20').customerId]\"\r\n            },\r\n            \"protectedSettings\": {\r\n              \"workspaceKey\": \"[listKeys(resourceId('Microsoft.OperationalInsights\/workspaces\/', parameters('workspaceName')), '2015-03-20').primarySharedKey]\"\r\n            }\r\n\r\n**Reference:** You can check the complete quick starter template for OMS integration here: [GitHub Sample - Deployment of a Windows VM with OMS Extension](https:\/\/github.com\/Azure\/azure-quickstart-templates\/tree\/master\/201-oms-extension-windows-vm)",
		"addpost": "addpost",
		"dated": "Oct 16, 2016",
		"slug": "step-by-step-arm-templates-deploying-a-windows-vm-with-oms-integration",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>You can deploy a Windows VM with OMS inte...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Azure Automation Preview Solution - Start\/Stop VMs during off-hours ",
		"postDate": "11-10-2016",
		"tags": [
			"Automation",
			"Azure",
			"AzureResourceManager",
			"Runbooks"
		],
		"category": "Azure",
		"body": "Starting and Stopping VMs during off-hours can mean lots of cost optimizations for you. We have been implementing this via custom Runbooks and schedules for various customers. Now there is out of the box support for this within Azure. The feature is currently in Preview but you can build on this.\r\n\r\n### What do I need - Prerequisites ###\r\n\r\nBefore beginning check that your region has this feature available. Just like with any other automation solution, you will need to have:\r\n\r\n 1. OMS Workspace (or you can create new while adding the solution)\r\n 2. Automation Account (or you can create new)\r\n 3. Azure Run As account (and not the Microsoft Account)\r\n 4. For email support, Office 365 business-class subscription is required\r\n\r\nNote: The VMs that you want to manage should be in the same subscription and resource group as where the Automation account resides.\r\n\r\n### How to Add ###\r\nTo Add the solution, click on \"+ New\" symbol and search for \"Start\/Stop VMs during off-hours\". You will find the below solution available to be created:\r\n\r\n![Start and Stop VMs Preview Solution](\/images\/1476808753580650317ab68.png)\r\n\r\n### What does it Contain ###\r\n\r\nThe solution is a combination of various automation assets:\r\n\r\n 1. Runbooks\r\n 2. Variables\r\n 3. Schedules\r\n 4. Credentials\r\n\r\nYou can change some configurations during and some after the deployment. \r\n\r\nFind out more here: [Start\/Stop VMs during off-hours [Preview]](https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/automation-solution-vm-management\/)\r\n",
		"addpost": "addpost",
		"dated": "Oct 11, 2016",
		"slug": "azure-automation-preview-solution-start-stop-vms-during-off-hours",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Starting and Stopping VMs during off-hours can mean lots of cost optimizations for you. We have been implementing this via custom Runbooks and schedules for various customers. Now there is out of the box support for this within Azure. The feature is currently in Preview but you can build on this....<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Azure RemoteApp is going away. New Purchases in portal are now stopped ",
		"postDate": "10-10-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"RemoteApp"
		],
		"category": "Azure",
		"body": "Today I got an email saying \"Action recommended: Deleting unnecessary RemoteApp collections can save you money\". This email is also a reminder from Microsoft that the RemoteApp is going away. We need to plan for the migration for the existing RemoteApps to other platforms.\r\n\r\n### What this means ###\r\nThis means various things to you. Most prominently:\r\n\r\n - Over the next year, the support for Remote App is going away\r\n - You need to plan and migrate the existing RemoteApp application to other platforms\r\n - New Purchases in the Azure portal for RemoteApp are no longer available\r\n\r\n### When is the service coming to Stop ###\r\n\r\nThe service will have support through **August 31st, 2017**. That's when this service will come to a stop. New service purchase was stopped effective October 1st, 2016.\r\n\r\n### What are my Options ###\r\n\r\nYou have various options for migration. The option being **recommended** by Microsoft is using \"**Citrix XenApp express**\". In fact, Microsoft is partnering up with Citrix on this. This service is not yet available and is currently under development. As this will be the native option in Azure this will be your best bet once it is announced. You can learn more about this solution here on Citrix site: [Citrix and Microsoft](https:\/\/www.citrix.com\/global-partners\/microsoft\/remote-app.html)\r\n\r\nThe second option is to use Remote Desktop Services (RDS) deployed on Azure IaaS. This means to set up the infrastructure yourself and then deploy and host the RDS solution on that infrastructure in Azure. You can know more about the steps here: [Host desktops and apps in Remote Desktop Services on Azure](https:\/\/technet.microsoft.com\/en-us\/windows-server-docs\/compute\/remote-desktop-services\/host-desktops-and-apps-in-remote-desktop-services)\r\n\r\nAnother option is to use  hosted solutions from various 3rd party vendors. You can find such solution from various partners from the Azure marketplace. You can also read and get to know the complete list of these hosting partners here: [RDS - Partners for hosting desktops and apps](https:\/\/technet.microsoft.com\/en-us\/windows-server-docs\/compute\/remote-desktop-services\/rds-hosting-partners)\r\n\r\n**In conclusion,** I will recommend to wait and look out for Citrix XenApp express solution. If you need new remote application solutions then you need to either deploy your own solution or use one of the hosted solutions by 3rd party vendors. You can read more about the official announcement here: [Application Remoting and the Cloud](https:\/\/blogs.technet.microsoft.com\/enterprisemobility\/2016\/08\/12\/application-remoting-and-the-cloud\/?WT.mc_id=azurebg_email_Trans_1218_No_Usage_Azure_RemoteApp)",
		"addpost": "addpost",
		"dated": "Oct 10, 2016",
		"slug": "azure-remoteapp-is-going-away-new-purchases-in-portal-are-now-stopped",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Today I got an email saying \"Action recommended: Deleting unnecessary RemoteApp collections can save you money\". This email is also a reminder from Microsoft that the RemoteApp is going away. We need to plan for the migration for the existing RemoteApps to other platforms.<\/p>\n<h3>What ...<\/h3>\n"
	},
	{
		"author": "@20aman",
		"title": "Script Sample - Generate Azure Resources Report by Tags",
		"postDate": "07-10-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Sample",
			"Script",
			"Tags"
		],
		"category": "Azure",
		"body": "When managing resources in Azure, Tags are there to help you. They add very valuable metadata to the Azure resources. \r\nIn nutshell, tags are Key-Value pairs. E.g. \"Business Unit = Finance\", \"Site = Central US\" are two such tags.\r\n\r\nThese **tags help you to**:\r\n\r\n - Organize your resources and manage the same\r\n - Get insights into Chargeback categorically\r\n\r\nTags go beyond the boundaries of deployments. You can have few resources deployed in one resource group and few other resources into the second resource group. If for these resources in both the resource groups you apply the same tag (i.e. same Key and value combination) then you can view and manage these resources in a single click.\r\n\r\nNow once in a while, you want to take a health check of your Azure environment. You want to see what all resources are there and what are the tags applied to these resources. You want to extract this data to a CSV file so that you can apply filters and perform other business intellegence (BI) operations on it. The script below provides exactly that. \r\n\r\nThe **script gives you** a CSV output report with:\r\n\r\n - All the resources in your Azure Subscription\r\n - Type of each resource, so that you can filter on various types\r\n - Tags for each of the resource in Azure\r\n\r\n**The Columns** in the Output CSV file (generated by the script) are:\r\n\r\n 1. Semi-colon separated list of tags\r\n 2. Resource Name\r\n 3. Resource Group Name\r\n 4. Location\r\n 5. Resource Type\r\n 6. Resource Id\r\n 7. Name\r\n 8. Subscription Id\r\n\r\n\r\nYou can find this script on GitHub here: [Azure Resources Report by Tags](https:\/\/github.com\/HarvestingClouds\/PowerShellSamples\/blob\/a4eb910aa8eb2cdd340c2866cde150282b47067e\/Scripts\/Azure%20Resources%20Report%20by%20Tags.ps1)\r\n\r\n[Direct Link to the Script here. Right click and choose Save As](https:\/\/raw.githubusercontent.com\/HarvestingClouds\/PowerShellSamples\/a4eb910aa8eb2cdd340c2866cde150282b47067e\/Scripts\/Azure%20Resources%20Report%20by%20Tags.ps1)\r\n\r\nYou are welcome to make changes and submit Pull Requests to this script or even fork and make your modifications. ",
		"addpost": "addpost",
		"dated": "Oct 03, 2016",
		"slug": "script-sample-generate-azure-resources-report-by-tags",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>When managing resources in Azure, Tags are there to help you. They add very valuable metadata to the Azure resources.\nIn nutshell, tags are Key-Value pairs. E.g. \"Business Unit = Finance\", \"Site = Central US\" are two such tags.<\/p>\n<p>These <strong>tags help you to<\/strong>:<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Iterating and creating multiple instances of a resource",
		"postDate": "27-09-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIn Azure Resource Manager (ARM) templates, you can define the variable once and then iterate\/loop over that definition and create multiple instances of that resource.\r\nThere are 3 special constructs in ARM templates to help you with this. \r\n\r\nThese **constructs** are:\r\n\r\n - **copy** - This is a property that is defined within the resource. This is the construct which when defined indicates that this resource needs to be looped over and created multiple times. It also specifies the number of times to iterate via \"count\" property.\r\n - **copyIndex()** - Used to access the current iteration value. Its value for the first iteration is **zero**. For the second iteration, its value is 1 and so on... You can pass it an integer (number) as a parameter. Whatever number you pass that will become the value for the first iteration and subsequent iterations. E.g. copyIndex(20) will compute to 20 in the first iteration, 21 in the second iteration and so on.\r\n - **length** - This is the method of arrays. It computes the number of elements in an array. It can be used to set the \"count\" property of \"copy\" construct.\r\n\r\n**Note:** Arrays are always **zero indexed**. What that means is that the first element of the array is indexed at 0, the second element of the array is indexed at 1, and so on...\r\n\r\n### 1. Simple Example ###\r\nLet us understand these constructs using an example.\r\n\r\n    \"parameters\": { \r\n      \"count\": { \r\n        \"type\": \"int\", \r\n        \"defaultValue\": 3 \r\n      } \r\n    }, \r\n    \"resources\": [ \r\n      { \r\n          \"name\": \"[concat('HarvestingClouds-', copyIndex(100))]\", \r\n          \"type\": \"Microsoft.Web\/sites\", \r\n          \"location\": \"Central US\", \r\n          \"apiVersion\": \"2015-08-01\",\r\n          \"copy\": { \r\n             \"name\": \"websitescopy\", \r\n             \"count\": \"[parameters('count')]\" \r\n          }, \r\n          \"properties\": {\r\n              \"serverFarmId\": \"hostingPlanName\"\r\n          }\r\n      } \r\n    ]\r\n\r\n The above example will **result** in creation of below 3 web apps in Azure:\r\n\r\n - HarvestingClouds-100\r\n - HarvestingClouds-101\r\n - HarvestingClouds-102\r\n\r\nNote the usage of \"copy\" property in the above code example:\r\n\r\n     \"copy\": { \r\n                 \"name\": \"websitescopy\", \r\n                 \"count\": \"[parameters('count')]\" \r\n              }\r\n\r\nAs you can notice above, the value of this property is another JSON object. This object has further two properties: \r\n\r\n - First is the name property, which provides the name to the looping construct. This can be any meaningful name. \r\n - The second property is the count, which specifies how many times this resource definition should be deployed. Note that the value is set to the parameter named \"count\". The name of the parameter can be anything but the value of the parameter has to be a number (i.e. an integer).\r\n\r\nNext, note how the name of the web application is constructed using the copyIndex() helper function.\r\n\r\n    \"name\": \"[concat('HarvestingClouds-', copyIndex(100))]\"\r\n\r\nThe above value uses two helper functions. First is the \"concat()\" which is concatenating (i.e. joining) two values. First value is the prefix string \"HarvestingClouds-\". Second parameter and the second helper function is `copyIndex(100)`. This specifies the current iteration value, which is offset with 100. So for the first iteration, the value will be 0+100 = 100, for the second iteration the value will be 1+100 = 101 and so on...\r\n\r\n\r\n###  2. Example with an Array ###\r\n\r\nLet's assume that you want to deploy multiple web apps for different purposes. You need one web app for Production, one for Staging or testing and one for Development. You want to name the web apps deployed with the purpose concatenated.\r\nThe below example uses an array to set the values for the web app name:\r\n\r\n    \"parameters\": { \r\n      \"purpose\": { \r\n         \"type\": \"array\", \r\n             \"defaultValue\": [ \r\n             \"Production\", \r\n             \"Staging\", \r\n             \"Development\" \r\n          ] \r\n      }\r\n    }, \r\n    \"resources\": [ \r\n      { \r\n          \"name\": \"[concat('HarvestingClouds-', parameters('purpose')[copyIndex()])]\", \r\n          \"type\": \"Microsoft.Web\/sites\", \r\n          \"location\": \"Central US\", \r\n          \"apiVersion\": \"2015-08-01\",\r\n          \"copy\": { \r\n             \"name\": \"websitescopy\", \r\n             \"count\": \"[length(parameters('purpose'))]\" \r\n          }, \r\n          \"properties\": {\r\n              \"serverFarmId\": \"hostingPlanName\"\r\n          } \r\n      } \r\n    ]\r\n\r\nThe **output** of the above sample will be 3 web apps deployed in Azure with following names:\r\n\r\n - HarvestingClouds-Production\r\n - HarvestingClouds-Staging\r\n - HarvestingClouds-Development\r\n\r\nNote in the above code sample that the parameter \"purpose\" is an array with 3 values i.e. Production, Staging, and Development. Then in the \"copy\" construct the count property is set using the length of this array as shown below. As there are 3 elements in the array, the value of count will be 3 and the resource will be deployed 3 times.\r\n\r\n    \"count\": \"[length(parameters('purpose'))]\" \r\n\r\nNext, the name of the web app is set using the copyIndex() and the array itself as shown below:\r\n\r\n    \"name\": \"[concat('HarvestingClouds-', parameters('purpose')[copyIndex()])]\"\r\n\r\nAs earlier, it uses concat helper function to add two strings. The first string is simple text i.e. \"HarvestingClouds-\", which becomes the prefix for the web app name. Second is finding out the value of the array based on the current iteration. For the first iteration, copyIndex() will compute to zero, therefore the second parameter becomes `parameters('purpose')[0]`. This will fetch the 0th element of the array which is Production. Similarly, for the second iteration, copyIndex() will compute to 1, therefore the second parameter becomes `parameters('purpose')[1]`. This will fetch the second element of the array (or element at index value 1) which is Staging, and so on...\r\n\r\n### 3. Depending upon resources being deployed by the copy Loop ###\r\n\r\nLet's assume you want to deploy a storage account. But you want to deploy it only after all the web apps are deployed by the loop. In this scenario, the dependsOn property of a resource is set to the name of the \"copy\" property of the resource, rather than the resource itself.\r\n\r\n        {\r\n            \"apiVersion\": \"2015-06-15\",\r\n            \"type\": \"Microsoft.Storage\/storageAccounts\",\r\n            \"name\": \"teststorage101\",\r\n            \"location\": \"[resourceGroup().location]\",\r\n            \"properties\": {\r\n                \"accountType\": \"Standard_LRS\"\r\n             }\r\n           \"dependsOn\": [\"websitescopy\"]\r\n        }\r\n\r\nNote above that the dependsOn property is set to the name property of the copy in the earlier web app example. This storage account will not be deployed until all 3 web apps are not deployed.\r\n\r\n### 4. Limitations ###\r\n\r\nThere are two limitations on the use of the copy to iterate and create multiple resource instances:\r\n\r\n 1. **Nested Resources** - You cannot use a copy loop for a nested resource. If you need to create multiple instances of a resource that you typically define as nested within another resource, you must instead create the resource as a top-level resource and define the relationship with the parent resource through the **type** and **name** properties.\r\n 2. **Looping Properties of a Resource** - You can only use copy on resource types, not on properties within a resource type. E.g. Creating multiple data disks within a VM.\r\n\r\n\r\n\r\nThat is all there is to iterate and creating multiple resources from a single definition. When your templates will start becoming complex then these constructs\/helper functions will help you a lot. E.g. you may need to deploy multiple load balanced resources, then you can use the concepts defined in this post.\r\n\r\nYou can also refer the official documentation here: [copy, copyIndex, and length](https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/resource-group-create-multiple\/)",
		"addpost": "addpost",
		"dated": "Sep 27, 2016",
		"slug": "step-by-step-arm-templates-iterating-and-creating-multiple-instances-of-a-resource",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>In Azure Resource Manager (ARM) templates...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Deploying ARM Templates using Visual Studio",
		"postDate": "20-09-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates",
			"VisualStudio"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIn the last blog we saw [How to use Visual Studio to author ARM templates](\/post\/step-by-step-arm-templates-authoring-arm-templates-using-visual-studio\/). In this blog we will see how to use Visual Studio (VS) to deploy the template without leaving VS.\r\n\r\nDeploying with Visual Studio is very simple, straightforward and very intuitive. Just follow the below steps.\r\n\r\n<ol>\r\n\r\n    <li>\r\nEither go to the Solution Explorer -> Right Click on the project and select \"Deploy -> New Deployment\" as shown below:<br \/>\r\n<img src=\"\/images\/147578624957f6b6090d5eb.png\" alt=\"New Deployment - Solution Explorer\" \/><br \/>\r\n\r\nOr you can go to the menu option Project -> Deploy -> New Deployment as shown below:<br \/>\r\n<img src=\"\/images\/147578624157f6b601b647b.png\" alt=\"New Deployment - Project Menu\" \/>\r\n\r\n<br \/>\r\nOnce you click on the \"New Deployment\", you will be presented with the below Dialog for the deployment.<br \/>\r\n<img src=\"\/images\/147578742957f6baa5bfb1c.png\" alt=\"New Deployment Dialog\" \/><br \/>\r\n\r\nIf you are not logged in then it will ask you to log into your Azure account. <br \/>\r\n\r\n    <\/li>\r\n\r\n    <li>\r\nIn the Dialog for \"Deploy to Resource Group\" select the Subscription by clicking on the first drop down.<br \/>\r\n    <\/li>\r\n\r\n    <li>\r\nNext click on the drop down for the Resource Group. You can either select an existing Resource Group or you can click on \"<Create New...>\" option to create a new resource group for the current deployment.\r\n<br \/>\r\n<img src=\"\/images\/147578768757f6bba7dd5ec.png\" alt=\"Resource Group creation\" \/>\r\n<br \/>\r\nIf you click on \"<Create New...>\" option to create a new Resource Group then you will be presented with an additional popup.\r\n<br \/>\r\n<img src=\"\/images\/147578794457f6bca893e66.png\" alt=\"Resource Group creation additional Popup\" \/><br \/>\r\nIn this additional popup, type the name for your new resoruce group and the location in Azure where this should be created. Click \"Create\" once done in the additional popup. <br \/><br \/>\r\n    <\/li>\r\n\r\n    <li>\r\nNext, we are going to provide the value for the parameters. Go ahead and click on the \"Edit Parameters...\" link in the \"Deploy to Resource Group\" dialog. This will open another popup to provide the parameters. <br \/>\r\nButton to edit parameters is shown below:<br \/>\r\n<img src=\"\/images\/147578820657f6bdae623f9.png\" alt=\"Edit Parameters\" \/> <br \/>\r\n\r\nAdditional dialog to provide parameters is shown below: <br \/>\r\n<img src=\"\/images\/147578821157f6bdb3ec989.png\" alt=\"Providing Parameters\" \/> <br \/>\r\n\r\nNote the following points in the parameters:\r\n<ol type=\"a\">\r\n<li>Corresponding to the string parameters, a text box is provided.<\/li>\r\n<li>For the secure string parameters like password, a secure password text box is provided.<\/li>\r\n<li>Corresponding to the parameters for which you have defined the \"Allowed Values\" in your template, a combo box (or drop Down) is provided with the \"default Value\" selected by default.<\/li>\r\n<\/ol>\r\n Click Ok once done\r\n   <\/li>\r\n\r\n    <li>\r\nNext, click on the Deploy button to deploy the template to Azure.\r\n    <\/li>\r\n\r\n    <li>\r\nYou can check the results in the <b>Outputs<\/b> window in the Visual Studio. Along with time stamp, it will show you what steps Visual Studio took to perform the deployment. It uses the values of parameters you provided and uses the PowerShell script to deploy the resources. You will notice the PowerShell window opening and prompt for the Admin Password. \r\n<br \/>\r\n<b>Note 1: <\/b>The PowerShell window may not come above as active window. Just search and click on the window in your Taskbar. <br \/>\r\nProvide the password and hit Enter as shown below:\r\n<img src=\"\/images\/147578930357f6c1f7c0b65.png\" alt=\"PowerShell window\" \/> <br \/>\r\n<br \/>\r\n<b>Note 2: <\/b>It may take some time to complete the deployment after that. Wait and do not close the PowerShell window. It should automatically close once done.\r\n<br \/>\r\n<b>Note 3: <\/b>Once the deployment completes the last line in Output window in Visual Studio will be: \"Successfully deployed template...\" as shown below:\r\n<br \/>\r\n<img src=\"\/images\/147578931057f6c1fecaa6a.png\" alt=\"Success - Output Window\" \/> <br \/>\r\n\r\n    <\/li>\r\n\r\n<\/ol>\r\n\r\nThis is it! Navigate to the Azure portal and validate the deployed resources in your selected resource group.",
		"addpost": "addpost",
		"dated": "Sep 20, 2016",
		"slug": "step-by-step-arm-templates-deploying-arm-templates-using-visual-studio",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>In the last blog we saw <a href=\"\/post\/st...\"><\/a><\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Authoring ARM Templates using Visual Studio",
		"postDate": "14-09-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates",
			"VisualStudio"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\n**Visual Studio** is a very powerful tool when it comes to authoring ARM Templates. \r\n\r\n**Key features** which make it a tool of our choice are:\r\n\r\n - In-house support for ARM Templates\r\n - Smart IntelliSense\r\n - Pre-populated templates for various Azure resources\r\n - JSON Outlining\r\n - Easy Deployment options\r\n\r\nThe screenshots in this blog post are from Visual Studio 2013. You can use other newer versions as well.\r\n\r\n### Pre-Requisites ###\r\n\r\nYou need to have Azure SDK installed to get true power of Visual Studio with Azure integration. If you don't have it already, you can install the same from here: [Azure SDK Downloads](https:\/\/azure.microsoft.com\/en-us\/downloads\/)\r\n\r\n### Authoring First ARM Template in Visual Studio ###\r\n\r\nAuthoring with Visual Studio is very easy. \r\n\r\n<ol type=\"1\">\r\n<li>To get started just launch the Visual Studio from the Start menu.<\/li>\r\n<li>Next, Create a new Project of type \"Azure Resource Group\" by navigating to Templates -> Visual C# -> Cloud <br \/><br \/>\r\n\r\n<img src=\"\/images\/147576108957f653c1768fc.png\" alt=\"New Project\" \/>\r\n<br \/>\r\n\r\n<\/li>\r\n\r\n<li>\r\n    Next, you will be presented with a dialog to \"Select Azure Template\". If you want to author from scratch then choose a Blank Template. Else select one of the starter template. For this blog, we will be using \"Windows Virtual Machine\" Template.<br \/><br \/>\r\n    <img src=\"\/images\/147576828457f66fdc0f0e6.png\" alt=\"Selecting Azure Template\" \/>\r\n    <br \/>\r\n<\/li>\r\n\r\n<li>\r\n    Project is created with various folders and files. You can explore the project in the solution explorer in Visual Studio.<br \/><br \/>\r\n    <img src=\"\/images\/147576986357f6760758619.png\" alt=\"Solution Explorer\" \/>\r\n    <br \/>\r\n\r\nLet us see what these folders and files are:\r\n        <ol type=\"a\">\r\n            <li><b>Scripts<\/b>: The single PS1 file is to create a new Resource Group and deploy the ARM Template. It uses \"New-AzureRmResourceGroupDeployment\" PowerShell cmdlet to deploy the template. <\/li>\r\n            <li><b>Templates<\/b>: \"<i>WindowsVirtualMachine.json<\/i>\" is the main ARM Template file that we are interested in. Also, \"<i>WindowsVirtualMachine.parameters.json<\/i>\" is the parameters file for the ARM template.<\/li>\r\n            <li><b>Tools<\/b>: This folder contains the \"AzCopy.exe\" file to help you copy any artifacts to Azure.<\/li>\r\n        <\/ol>\r\n<\/li>\r\n\r\n<li>\r\n    Double click and open the \"<i>WindowsVirtualMachine.json<\/i>\" file to open it. You will be presented with a huge JSON file. Collapse the section by clicking the small \"-\" signs to the left of the file. Also notice the <b>JSON Outline<\/b> panel to the left. This is your biggest friend in Visual Studio when authoring ARM Templates.<br \/><br \/>\r\n    <img src=\"\/images\/147577487757f6899d297b5.png\" alt=\"\" \/>\r\n    <br \/>\r\nYou can immediately notice that key sections both in the template in the middle and in the JSON Oultine panel on the left (in the image above) are:\r\n               <ol type=\"a\">\r\n                   <li>parameters<\/li>\r\n                   <li>variables<\/li>\r\n                   <li>resources<\/li>\r\n               <\/ol>\r\nYou can click on any of the elements in the left JSON Outline panel and the same section will be highlighted in the center, in the JSON template file.\r\n    <br \/>\r\n\r\n<\/li>\r\n\r\n<li>\r\n    Next, let us look at JSON Outline panel and check how it can provide us more information and help us in authoring templates.<br \/><br \/>\r\n    <img src=\"\/images\/147578115457f6a2226c2be.png\" alt=\"JSON Outline Panel\" \/>\r\n    <br \/>\r\n    You can see that the panel provides a special icon for each type of the resource. In our current template the various resources listed are:\r\n    <ol type=\"a\">\r\n        <li>StorageAccount<\/li>\r\n        <li>PublicIPAddress<\/li>\r\n        <li>VirtualNetwork<\/li>\r\n        <li>NetworkInterface<\/li>\r\n        <li>VirtualMachine<\/li>\r\n    <\/ol>\r\n\r\nClick on each of the resources and inspect how their JSON structure looks and differs. You will immediately notice that the major difference in each of these resources is in their <b>Type<\/b> and <b>Properties<\/b>.\r\n\r\n<h3>Adding New Resource<\/h3> \r\nLet's assume you want to add a new resource to this template. You have 2 ways to achieve the same:\r\n    <ol>\r\n    <li><b>Method 1<\/b> - Create a new resource by modifying and adding the JSON for the new resource in the template.<\/li>\r\n    <li><b>Method 2<\/b> - Let Visual Studio add the resource for you. Right click anywhere in the resources area of the JSON Outline Panel or the small \"+\" box at the top left of the panel (as shown in the image above) and VS will give you a new popup to add the resource from pre-defined resources as shown below.<\/li>\r\n    <\/ol>\r\n    <img src=\"\/images\/147578170157f6a4457bae0.png\" alt=\"Add Resource\" \/>\r\n<br \/>\r\nOnce you click Add the JSON for resource will be added to the template and the corresponding new element will appear in the JSON Outline Panel.\r\n<br \/>\r\n\r\n<h3>Deleting a Resource<\/h3> <br \/>\r\nIf you need to delete a resource, simply right click on that resource in the JSON outline panel on the left and then select \"Delete Resource\".\r\n<br \/>\r\n\r\n<h3>Using Intellisense<\/h3>     \r\nThe last thing to notice is the use of <b>Intellisense<\/b> in Visual Studio which helps you as you are editing the templates.<br \/><br \/>\r\n    <img src=\"\/images\/147578465457f6afce4debb.png\" alt=\"Intellisense\" \/>\r\n    <br \/>\r\n     When you type quotes the closing quotes are automatically provided. Also, as you can see in the above image the various valid values, that can come there are also shown along with small tooltip about the data type. If the Intellisense doesn't come up automatically, then press Ctrl + Space to get Intellisense.\r\n<\/li>\r\n\r\n<\/ol>\r\n\r\nIn the end, the Visual Studio makes authoring ARM templates much more manageable and easy for you.\r\n\r\nIn the next blog, we will see how to use Visual Studio to Deploy the templates.\r\n",
		"addpost": "addpost",
		"dated": "Sep 17, 2016",
		"slug": "step-by-step-arm-templates-authoring-arm-templates-using-visual-studio",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p><strong>Visual Studio<\/strong> is a very ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Creating Parameters file for an ARM Template",
		"postDate": "14-09-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"JSON",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nYou can pass the input values for the Parameters in your ARM template using an additional JSON file. This additional file is what we will be referring to as **Parameters File**.\r\n\r\nThe only restriction on a parameters file is that the size of the parameter file cannot be more than 64 KB.\r\n\r\nParameters file follows a similar structure to the ARM Template. They are very simple as compared to the ARM template. In all they have 3 sections as explained below:\r\n\r\n 1. **$schema** - Required Object - Location of the JSON schema file that describes the version of the template language.\r\n 2. **contentVersion** - Required Object - Version of the template (such as 1.2.0.20). When deploying resources using the template, this value can be used to make sure that the right template is being used.\r\n 3. **parameters** - Required Object - This is a JSON object which contains various objects as it's members. Each object within the \"parameters\" object represent a value for a parameter corresponding to your ARM template.\r\n\r\nLet's check how the parameters file will look like for the ARM template we have built earlier for deploying Storage Account and a Virtual Network.\r\n\r\n    {\r\n        \"$schema\": \"https:\/\/schema.management.azure.com\/schemas\/2015-01-01\/deploymentParameters.json#\",\r\n        \"contentVersion\": \"1.0.0.0\",\r\n        \"parameters\": {\r\n            \"vhdStorageName\": {\r\n                \"value\": \"harvestingstorage101\"\r\n            },\r\n            \"virtualNetworkName\": {\r\n                \"value\": \"testvNet101\"\r\n            }\r\n        }\r\n    }\r\n\r\nNote that the only 2 parameter values are provided. These correspond to the parameters in the ARM template. \r\n\r\n**Note:** The parameter names should match to the parameters defined in the ARM template.",
		"addpost": "addpost",
		"dated": "Sep 14, 2016",
		"slug": "step-by-step-arm-templates-creating-parameters-file-for-an-arm-template",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>You can pass the input values for the Par...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Deploying Template Using Azure PowerShell",
		"postDate": "11-09-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"PowerShell",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIn the previous blog you learned [How to build your first ARM Template](\/post\/step-by-step-arm-templates-building-your-first-arm-template\/) . Now that you have a fully functional ARM template we want to deploy this template to Azure.\r\n\r\nThere are various options to deploy a template to Azure. We already saw in the last blog [How to deploy template using **Azure Portal**](\/post\/step-by-step-arm-templates-deploying-template-using-azure-portal\/). Now we will look at **Azure PowerShell** as more programmatic and automated way to deploy the template.\r\n\r\n## Pre-requisites ##\r\n\r\nThings you should know before deployment\r\n\r\n 1. **Azure PowerShell** - This should be installed on the machine from where the Steps will be followed. If you don't have this then use this link to get it: [Get Azure PowerShell](https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/powershell-install-configure\/)\r\n 2. **Azure Subscription** - where you want to deploy your template\r\n 3. **Resource Group** - This is the resource group in Azure where you will be deploying your template. You can create a new resource group (for the resources that will be deployed by the template) or use an existing one.\r\n 4. **Parameters** - Value of the input parameters to the template should be known to you for the deployment. Follow all your naming conventions when defining the parameters for deployments of resources in Azure. \r\n 5. **Internet Connectivity** - This should be present on the machine from where the Steps will be followed for connectivity to Azure\r\n\r\n## Steps for Deployment ##\r\n\r\n- First, launch a PowerShell window as an Administrator\r\n- Then, log into the Azure account. \r\n\r\nRun the below cmdlet to log into Azure:\r\n\r\n    Add-AzureRmAccount\r\n\r\n- Select appropriate Azure Subscription\r\n\r\nYou have two choices here. You can either use below cmdlet to use Subscription ID\r\n\r\n    Set-AzureRmContext -SubscriptionID <YourSubscriptionId>\r\n\r\nOr you can use the Subscription name with the below cmdlet:\r\n\r\n    Select-AzureRmSubscription -SubscriptionName \"<Your Subscription Name>\"\r\n\r\n- Next, if you already have a resource group to which you want to deploy the template then skip this step. Else create a new resource group. A resource in Azure ARM architecture can only exist in a resource group. \r\n\r\nUse below cmdlet to create a new Resource Group:\r\n\r\n    New-AzureRmResourceGroup -Name TestResourceGroup01 -Location \"Central US\"\r\n\r\n- Before deploying the Resource Template to Azure, you should Test it. This step is optional but highly recommended.\r\n\r\nUse the below cmdlet to test and validate your template:\r\n\r\n    Test-AzureRmResourceGroupDeployment -ResourceGroupName TestResourceGroup01 -TemplateFile <PathToJsonTemplate>\r\n\r\n- Now comes the last step i.e. to deploy the template. You have two options when deploying the template. You can either deploy a template without any parameters (if none are required) or you need to specify the parameters. Let's check both these options next.\r\n\r\n### Deploying Template which doesn't need Parameters ###\r\n\r\nYou can deploy such template using `New-AzureRmResourceGroupDeployment` cmdlet. \r\nIf the template file is on a local directory then use the below cmdlet:\r\n\r\n    New-AzureRmResourceGroupDeployment -Name ExampleDeployment -ResourceGroupName TestResourceGroup01 -TemplateFile <PathToTemplate>\r\n\r\nIf the template file is uploaded to some hosted location and is accessible via a link, then use the below cmdlet to deploy the template:\r\n\r\n    New-AzureRmResourceGroupDeployment -Name ExampleDeployment -ResourceGroupName TestResourceGroup01 -TemplateUri <LinkToTemplate>\r\n\r\n### Deploying Template with Parameters ###\r\n\r\nDeploying of the template is exactly similar as the previous section. You use the same cmdlet. To specify the parameter, you have 4 options. Use the below cmdlets for the option you want to use.\r\n\r\n**Option 1** - Using Inline Parameter\r\n\r\n    New-AzureRmResourceGroupDeployment -Name ExampleDeployment -ResourceGroupName TestResourceGroup01 -TemplateFile <PathToTemplate> -myParameterName \"parameterValue\" -secondParameterName \"secondParameterValue\"\r\n\r\n**Option 2** - Using Parameter Object\r\n\r\n    $parameters = @{\"<ParameterName>\"=\"<Parameter Value>\"}\r\n    New-AzureRmResourceGroupDeployment -Name ExampleDeployment -ResourceGroupName TestResourceGroup01 -TemplateFile <PathToTemplate> -TemplateParameterObject $parameters\r\n\r\n**Option 3** - Using Parameter file which is in local environment\r\n\r\n    New-AzureRmResourceGroupDeployment -Name ExampleDeployment -ResourceGroupName TestResourceGroup01 -TemplateFile <PathToTemplate> -TemplateParameterFile <PathToParameterFile>\r\n\r\n**Option 4** - Using Parameter file which is located externally and can be referenced via Link\r\n\r\n    New-AzureRmResourceGroupDeployment -Name ExampleDeployment -ResourceGroupName TestResourceGroup01 -TemplateUri <LinkToTemplate> -TemplateParameterUri <LinkToParameterFile>\r\n\r\n### Key Gotchas ###\r\n\r\n 1. If you provide values for a parameter in both the local parameter file and inline, the inline value takes precedence.\r\n 2. You cannot use inline parameters with an external parameter file. All inline parameters are ignored when you specify \"TemplateParameterUri\" parameter.\r\n 3. As a best practice, do not store sensitive infomation in the parameters file e.g. Local admin password. Instead either provide these dynamically using inline parameters. Or store them using the Azure Key vault and then reference the key vault in your parameters file.\r\n\r\nYou can find more details about these cmdlets here: [Deploy resources with Resource Manager templates and Azure PowerShell](https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/resource-group-template-deploy\/#deploy-with-powershell)\r\n\r\nIn the next blog, we will see how to create a Parameters File for providing parameters dynamically to the template.",
		"addpost": "addpost",
		"dated": "Sep 11, 2016",
		"slug": "step-by-step-arm-templates-deploying-template-using-azure-powershell",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>In the previous blog you learned <a href=\"...\"><\/a><\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Deploying Template Using Azure Portal",
		"postDate": "08-09-2016",
		"tags": [
			"ASR",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIn the last blog you learned [How to build your first ARM Template](\/post\/step-by-step-arm-templates-building-your-first-arm-template\/) . Now that you have a fully functional ARM template we want to deploy this template to Azure.\r\n\r\nThere are various options to deploy a template to Azure. Using Azure portal is by far the easiest and most intuitive option for the deployment. Follow the steps in this blog to deploy your template to Azure.\r\n\r\n## Pre-requisites ##\r\n\r\nThings you should know before deployment\r\n\r\n 1. **Azure Subscription** - where you want to deploy your template\r\n 2. **Resource Group** - This is the resource group in Azure where you will be deploying your template. You can create a new resource group (for the resources that will be deployed by the template) or use an existing one.\r\n 3. **Parameters** - Value of the input parameters to the template should be known to you for the deployment. Follow all your naming conventions when defining the parameters for deployments of resources in Azure.\r\n\r\n## Steps for Deployment ##\r\n\r\n 1. First, log into the Azure Portal.\r\n 2. Next, go to \"New\" and type \"Template deployment\" in the search box and hit enter.\r\n\r\n    ![New Deployment](\/images\/147559616157f3cf81381da.png)\r\n\r\n 3. Next, click on the **Template Deployment** and then click on \"Create\"\r\n\r\n    ![Create Deployment](\/images\/147559654057f3d0fc1bf5c.png)\r\n\r\n 4. Now click on the \"**Template (Edit Template)**\". It will open a panel to paste your template. Delete whatever is auto populated in the template area. Copy your whole json template and paste it here. Note that the left section in the new panel will update to show you what parameters, variables, and resources you have in the template. Click on \"Save\" once done.\r\n\r\n    ![Editing Template](\/images\/147559697957f3d2b32ff67.png)\r\n\r\n 5. Next, click on the \"**Parameters (Edit Parameters)**\" on the left side. The parameters will be automatically picked from the template. The parameters for which the default value is provided will be automatically populated. Rest you will have to provide the inputs. Click Ok once done.\r\n\r\n    ![Providing Parameters](\/images\/147559719657f3d38c652e3.png)\r\n\r\n 6. Next, you have the option to select the **Resource Group**. You can either create a new resource group (for all the resources that will be deployed via the template) or you can use and existing resource group.\r\n\r\n    ![Resource Group Selection](\/images\/147559727457f3d3da45879.png)\r\n\r\n 7. The last option is to click on the \"**Legal Terms**\" and read through the terms. If you agree then click on the \"Purchase\" button. \r\n\r\n   ![Legal Terms](\/images\/147559762057f3d534eae90.png)\r\n\r\n 8. Finally, click on the **Create** to submit the deployment. \r\n\r\nYou can monitor the job performing the deployments and progress of the same. After some time the deployment will finish successfully and you can view the resources in the resource group you selected.",
		"addpost": "addpost",
		"dated": "Sep 08, 2016",
		"slug": "step-by-step-arm-templates-deploying-template-using-azure-portal",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>In the last blog you learned <a href=\"\/po...\"><\/a><\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Building your first ARM Template",
		"postDate": "04-09-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIn this blog post, we will use the knowledge learned in previous blogs and will build a basic ARM template. \r\nIf you haven't checked previous blog posts then have a quick read of your preferred topics here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nTo follow this blog, you can use any text editor which can provide JSON syntax highlighting. We will be looking at using Visual Studio to author ARM templates in a future blog post. Visual Studio can provide JSON outlining and is a very powerful tool for authoring ARM templates.\r\n\r\nLet us assume that you want to deploy a storage account and build a virtual network in Azure. You want to automate the process and need to repeat the process in various environments. ARM templates fit the bill for the solution of this problem.\r\n\r\nIn the next few sections, we will build each section of the template and then at the end will check the complete template.\r\n\r\n### 1. Template Header ###\r\n\r\nThis section is very basic and contains just the schema and the content version. You can use the content version to manage the development versions of the template as you make changes to your templates in the future.\r\n\r\n    \"$schema\": \"https:\/\/schema.management.azure.com\/schemas\/2015-01-01\/deploymentTemplate.json#\",\r\n    \"contentVersion\": \"1.0.0.0\",\r\n\r\n### 2. Parameters ###\r\n\r\nHere we define all the inputs we need from the end users. We provide default values for those parameters for which we know what the most common values will be based on our environment. For the current template we define two parameters:\r\n\r\n - **vhdStorageName** - This is the name of the storage account in Azure which will be created by the deployment of this template.\r\n - **virtualNetworkName** - This is the name of the Virtual Network which will be created by the deployment of this template.\r\n\r\nAs a best practice, provide the metadata, describing what each parameter is for. Also, note that we have used pascal casing to name the parameters with very descriptive names.\r\n\r\n    \"parameters\": {\r\n        \"vhdStorageName\": {\r\n            \"type\": \"string\",\r\n            \"minLength\": 1,\r\n            \"defaultValue\": \"mystorage101\",\r\n            \"metadata\": {\r\n                \"description\": \"Name of the Storage Account.\"\r\n            }\r\n        },\r\n        \"virtualNetworkName\": {\r\n            \"type\": \"string\",\r\n            \"metadata\": {\r\n                \"description\": \"Name of the virtual network.\"\r\n            }\r\n        }\r\n    },\r\n\r\n### 3. Variables ###\r\n\r\nNext, we add some variables for the values which will be reused later in the template in the resources section. We create variables for all those reusable values for which we know what their value at deployment will be. We define 4 variables in this template:\r\n\r\n - **addressPrefix** - Address prefix for the Virtual Network \r\n - **subnetName** - Subnet name which will be created under the virtual network\r\n - **subnetPrefix** - Subnet prefix for the subnet, which will be created under the virtual network\r\n - **vhdStorageType** - Type of the storage account. Here we used Standard locally redundant storage (LRS)\r\n\r\nVariables section look as below:\r\n\r\n    \"variables\": {\r\n        \"addressPrefix\": \"10.0.0.0\/16\",\r\n        \"subnetName\": \"Subnet\",\r\n        \"subnetPrefix\": \"10.0.0.0\/24\",\r\n        \"vhdStorageType\": \"Standard_LRS\"\r\n    },\r\n\r\n### 4. Resources ###\r\n\r\nNow comes the last and main section i.e. Resources. Here we define both the resources for our template:\r\n\r\n - Storage Account\r\n - Virtual Network\r\n\r\nLet us look at each of these resources one by one.\r\n\r\n**A. Storage Account Resource**\r\n\r\nThis resource has below properties (or key-value pairs):\r\n\r\n 1. **Type** - Type of the resource is set to Microsoft.Storage\/storageAccounts. This is what tells the Azure that the current resource is a Storage Account\r\n 2. **Name** - This defines the name of the storage account to be deployed based on the parameter to the template\r\n 3. **API Version** - this is the standard version for the REST API in Azure\r\n 4. **Location** - This is the Azure location. The location is found dynamically based on the location of the resource group to which this template will be deployed.\r\n 5. **tags** - only one tag is defined for the display name. You should have more tags in case of a production ready template\r\n 6. **properties** - This is where you tell Azure what kind of storage account you need. Here the account type is set using the value of the variable vhdStorageType.\r\n\r\n**B. Virtual Network Resource**\r\n\r\nThis resource has below properties (or key-value pairs):\r\n\r\n 1. **Type** - Type of the resource is set to Microsoft.Network\/virtualNetworks. This is what tells the Azure that the current resource is a Virtual Network\r\n 2. **Name** - This defines the name of the virtual network to be deployed based on the parameter to the template\r\n 3. **API Version** - this is the standard version for the REST API in Azure\r\n 4. **Location** - This is the Azure location. The location is found dynamically based on the location of the resource group to which this template will be deployed.\r\n 5. **tags** - only one tag is defined for the display name. You should have more tags in case of a production ready template\r\n 6. **properties** - This is where you define the address space for the virtual network. You also define the subnet under the virtual network here.\r\n\r\n\r\nThe resources section look like below:\r\n\r\n    \"resources\": [\r\n        {\r\n            \"type\": \"Microsoft.Storage\/storageAccounts\",\r\n            \"name\": \"[parameters('vhdStorageName')]\",\r\n            \"apiVersion\": \"2015-06-15\",\r\n            \"location\": \"[resourceGroup().location]\",\r\n            \"tags\": {\r\n                \"displayName\": \"StorageAccount\"\r\n            },\r\n            \"properties\": {\r\n                \"accountType\": \"[variables('vhdStorageType')]\"\r\n            }\r\n        },\r\n        {\r\n            \"apiVersion\": \"2015-06-15\",\r\n            \"type\": \"Microsoft.Network\/virtualNetworks\",\r\n            \"name\": \"[parameters('virtualNetworkName')]\",\r\n            \"location\": \"[resourceGroup().location]\",\r\n            \"tags\": {\r\n                \"displayName\": \"VirtualNetwork\"\r\n            },\r\n            \"properties\": {\r\n                \"addressSpace\": {\r\n                    \"addressPrefixes\": [\r\n                        \"[variables('addressPrefix')]\"\r\n                    ]\r\n                },\r\n                \"subnets\": [\r\n                    {\r\n                        \"name\": \"[variables('subnetName')]\",\r\n                        \"properties\": {\r\n                            \"addressPrefix\": \"[variables('subnetPrefix')]\"\r\n                        }\r\n                    }\r\n                ]\r\n            }\r\n        }\r\n    ]\r\n\r\n### Complete Template ###\r\n\r\nHere is the complete template build from all the sections discussed above. You can copy and use this template for testing and working along with next deployment posts.\r\n\r\n    {\r\n        \"$schema\": \"https:\/\/schema.management.azure.com\/schemas\/2015-01-01\/deploymentTemplate.json#\",\r\n        \"contentVersion\": \"1.0.0.0\",\r\n        \"parameters\": {\r\n            \"vhdStorageName\": {\r\n                \"type\": \"string\",\r\n                \"minLength\": 1,\r\n                \"defaultValue\": \"mystorage101\",\r\n                \"metadata\": {\r\n                    \"description\": \"Name of the Storage Account.\"\r\n                }\r\n            },\r\n            \"virtualNetworkName\": {\r\n                \"type\": \"string\",\r\n                \"metadata\": {\r\n                    \"description\": \"Name of the virtual network.\"\r\n                }\r\n            }\r\n        },\r\n        \"variables\": {\r\n            \"addressPrefix\": \"10.0.0.0\/16\",\r\n            \"subnetName\": \"Subnet\",\r\n            \"subnetPrefix\": \"10.0.0.0\/24\",\r\n            \"vhdStorageType\": \"Standard_LRS\"\r\n        },\r\n        \"resources\": [\r\n            {\r\n                \"type\": \"Microsoft.Storage\/storageAccounts\",\r\n                \"name\": \"[parameters('vhdStorageName')]\",\r\n                \"apiVersion\": \"2015-06-15\",\r\n                \"location\": \"[resourceGroup().location]\",\r\n                \"tags\": {\r\n                    \"displayName\": \"StorageAccount\"\r\n                },\r\n                \"properties\": {\r\n                    \"accountType\": \"[variables('vhdStorageType')]\"\r\n                }\r\n            },\r\n            {\r\n                \"apiVersion\": \"2015-06-15\",\r\n                \"type\": \"Microsoft.Network\/virtualNetworks\",\r\n                \"name\": \"[parameters('virtualNetworkName')]\",\r\n                \"location\": \"[resourceGroup().location]\",\r\n                \"tags\": {\r\n                    \"displayName\": \"VirtualNetwork\"\r\n                },\r\n                \"properties\": {\r\n                    \"addressSpace\": {\r\n                        \"addressPrefixes\": [\r\n                            \"[variables('addressPrefix')]\"\r\n                        ]\r\n                    },\r\n                    \"subnets\": [\r\n                        {\r\n                            \"name\": \"[variables('subnetName')]\",\r\n                            \"properties\": {\r\n                                \"addressPrefix\": \"[variables('subnetPrefix')]\"\r\n                            }\r\n                        }\r\n                    ]\r\n                }\r\n            }\r\n        ]\r\n    }\r\n\r\nIn the next blog, we will learn how to deploy this template.\r\n",
		"addpost": "addpost",
		"dated": "Sep 04, 2016",
		"slug": "step-by-step-arm-templates-building-your-first-arm-template",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>In this blog post, we will use the knowle...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - Helper Functions",
		"postDate": "31-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nARM Templates has various dynamic constructs called **Helper Functions** which can make your template more generic. These constructs reduce the hard coded values in your templates. You can use the information from this blog to make your existing templates more dynamic and start writing new templates with a much generic approach.\r\n\r\nLet's look at the most important helper functions and their practical usage one by one. \r\n\r\n### 1. Resource Id - Resource Function ###\r\n\r\nYou use this function to determine the ID of a resource. This is only used when the resource (whose ID is needed) is not being deployed in the current template and it already exists in Azure.\r\n\r\nThe generic syntax to use this is:\r\n\r\n    resourceId ([subscriptionId], [resourceGroupName], resourceType, resourceName1, [resourceName2]...)\r\n\r\nOnly required parameters of this helper function are resourceType and resourceName1.\r\n\r\nThese parameters are as follows:\r\n\r\n - subscription ID - This is only needed if you want to refer a different subscription. Default value is the current subscription\r\n - resource Group Name - Name of the resource group where the resource exists. Default is the current resource group, in which you are deploying the template\r\n - resource Type - Type of resource including resource provider namespace\r\n - resource Name 1  - Name of the resource\r\n - resource Name 2  - Next resource name segment if resource is nested. E.g. a VM Extension\r\n\r\n \r\n**Example**\r\n\r\n    \"vnetId1\": \"[resourceId('AE06-Mgmt-RG','Microsoft.Network\/virtualNetworks', parameters('virtualNetworkName'))]\",\r\n    \"vnetId2\": \"[resourceId('Microsoft.Network\/virtualNetworks', variables('virtualNetworkName'))]\"\r\n\r\nThe above example shows two ways of using the resource ID helper function to determine the Id of a virtual network. First one uses the resource group, resource type and resource name. Second example uses only the resource Type and resource name. Second example assumes the resource group to be same as the template being deployed to.\r\n\r\n### 2. Resource Group - Resource Function ###\r\n\r\nThis helper function returns an object that represents the current resource group to which the template is being deployed.\r\n\r\nThe generic syntax to use this is:\r\n\r\n    resourceGroup()\r\n\r\nNo parameters are needed in this helper function.\r\n\r\n**Example**\r\n\r\n    \"vhdStorageName\": \"[concat('vhdstorage', uniqueString(resourceGroup().id))]\",\r\n     \"storageAccountResourceGroup\": \"[resourcegroup().name]\",\r\n     \"location\": \"[resourceGroup().location]\"\r\n\r\nThe above example shows 3 uses of the resource group helper functions. First one uses the ID of the resource group, second uses the name property and third uses the location for the current resource group.\r\n\r\n### 3. Subscription - Resource Function ###\r\n\r\nThe generic syntax to use this is:\r\n\r\n    subscription()\r\n\r\nNo parameters are needed in this helper function.\r\n \r\n**Example**\r\n\r\n    \"subscriptionId\": \"[subscription().subscriptionId]\"\r\n\r\nThe above example is straightforward. It fetches the subscription Id of the current subscription.\r\n\r\n### 4. Concat - String Function ###\r\n\r\nThis function is used to concatinate (i.e. combine) two or more values.\r\n\r\nThe generic syntax to use this is:\r\n\r\n    concat (array1, array2, array3, ...)\r\n\r\nAt least 1 array is needed for concat to work. \r\n \r\n**Example**\r\n\r\n    \"subnetRef\": \"[concat(variables('vNetId'), '\/subnets\/', variables('subnetName'))]\"\r\n\r\nThe above example combines (or concatinates) 3 text values. First value is the value of variable vNetId. Second value is a string \"\/subnets\/\". Third value is the value of the variable subnet Name.\r\n\r\nThese are the most common Helper functions that you will use in 80%-90% of the templates. \r\n\r\nTo check the complete list of Helper Functions, check this official link: [Azure Resource Manager template functions](https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/resource-group-template-functions\/#resource-functions)\r\n",
		"addpost": "addpost",
		"dated": "Aug 31, 2016",
		"slug": "step-by-step-arm-templates-helper-functions",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>ARM Templates has various dynamic constru...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - What is in an ARM Template - Understanding Components 5 - Outputs",
		"postDate": "30-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIf you haven't checked the previous blog on the overall structure of the ARM template, I suggest you give it a quick read before checking the component described in this post in detail.\r\n\r\n 1. [Understanding all components](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-all-components\/)\r\n 2. [Parameters](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-2-parameters\/)\r\n 3. [Variables](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-3-variables\/)\r\n 4. [Resources](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-4-resources\/)\r\n 5. [Outputs - This blog post](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-5-outputs\/)\r\n\r\n## Outputs ##\r\n\r\nThis section is used to output any values after the deployment of the ARM Template. This can output any Ids or connection strings based on the deployed resources. \r\n\r\nThis is a single JSON object with various output objects (just like Parameters. The overall JSON structure looks like below:\r\n\r\n    \"outputs\": { \r\n        \"output1\" : {\r\n                         \"type\":\"string\",\r\n                         \"value\": \"value1\"\r\n          },\r\n        \"output2\" : {\r\n                         \"type\":\"string\",\r\n                         \"value\": \"value2\"\r\n          },\r\n    }\r\n\r\nEach output object has 2 properties:\r\n\r\n 1. Type - Data type of the output\r\n 2. Value - value of the output\r\n\r\nA real life example with look like below:\r\n\r\n    \"outputs\": {\r\n        \"adminUsername\": {\r\n            \"type\": \"string\",\r\n            \"value\": \"[parameters('adminUsername')]\"\r\n        }\r\n    }\r\n\r\nThe above example will output the administrator Username using the parameter from the template.\r\n\r\nThat's all there is to Outputs in ARM Templates. If you have any doubts, please comment in the below section. Use the links at the Top to know all about other components in an ARM Template.",
		"addpost": "addpost",
		"dated": "Aug 30, 2016",
		"slug": "step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-5-outputs",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>If you haven't checked the previous blog ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - What is in an ARM Template - Understanding Components 4 - Resources",
		"postDate": "29-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIf you haven't checked the previous blog on the overall structure of the ARM template, I suggest you give it a quick read before checking the component described in this post in detail.\r\n\r\n 1. [Understanding all components](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-all-components\/)\r\n 2. [Parameters](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-2-parameters\/)\r\n 3. [Variables](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-3-variables\/)\r\n 4. [Resources  - This blog post](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-4-resources\/)\r\n 5. [Outputs](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-5-outputs\/)\r\n\r\n## Resources ##\r\n\r\nThis is the major section of the whole ARM template. This is where you define what resources should be deployed in Azure. You also define dependencies between resources in this section. \r\n\r\nThe resources section consist of an array of JSON Objects as shown below:\r\n\r\n    \"resources\": [\r\n            { },\r\n            { },\r\n    ]\r\n\r\nEach object in the array (represented via curly braces) is an Azure resource. You can deploy multiple resources in a single ARM template. E.g. You can deploy a new Storage Account, new Virtual Network and three Virtual Machines in that virtual network within a single template.\r\nWithin the object, various properties (and nested properties) are used to provide the configurations of each resource. \r\n\r\n### Elements ###\r\n\r\nDifferent elements in a single resource object can be one of the following:\r\n\r\n 1. **apiVersion** - ***Required*** - Version of the API. e.g. \"2015-06-15\"\r\n 2. **type** - ***Required*** - Type of the resource. This value is a combination of the namespace of the resource provider and the resource type that the resource provider supports. e.g. Azure Storage Account will have type as \"Microsoft.Storage\/storageAccounts\".\r\n 3. **name** - ***Required*** - Name of the resource. The name must follow URI component restrictions and also the Azure naming restrictions if any. E.g. Storage account name can only be in small letters and has to be unique.\r\n 4. **location** - Optional - Use supported geo-locations of the provided resource without any spaces. Or use the resource group's location dynamically.\r\n 5. **tags** - Optional - Tags that are associated with the resource.\r\n 6. **dependsOn** - Optional - Other resources in the same template, that the current resource being defined depends on. The dependencies between resources are evaluated and resources are deployed in their dependent order. When resources are not dependent on each other, they are attempted to be deployed in parallel. The value can be a comma-separated list of resource names or resource unique identifiers.\r\n 7. **properties** - Optional - Resource specific configuration settings. E.g. Account type property for a storage account name.\r\n 8. **resources** - Optional - Child resources that depend on the resource being defined. E.g. Extension resources for a Virtual Machine resource.\r\n\r\n### Examples ###\r\n\r\nLet's look at two examples. First, we will take a simple resource example to deploy a storage account in Azure:\r\n\r\n    {\r\n                \"type\": \"Microsoft.Storage\/storageAccounts\",\r\n                \"name\": \"[variables('vhdStorageName')]\",\r\n                \"apiVersion\": \"2015-06-15\",\r\n                \"location\": \"[resourceGroup().location]\",\r\n                \"tags\": {\r\n                    \"displayName\": \"StorageAccount\",\r\n                    \"department\" : \"Finance\",\r\n                    \"application\" : \"database\"\r\n                },\r\n                \"properties\": {\r\n                    \"accountType\": \"[variables('vhdStorageType')]\"\r\n                }\r\n            }\r\n\r\nAbove example will deploy a storage account with the name from \"vhdStorageName\" variable. It will apply 3 tags to the resource after deployment. It will use the account type (i.e. standard or premium) based on the value of the \"vhdStorageType\" variable. If you want to deploy 2 or more similar storage accounts, then just copy and paste the json for the resource, separated by comma. It will become another object in the Resources array.\r\n\r\nNow let's look at a complex and larger example of deploying a single virtual machine with one extension for Diagnostics.\r\n\r\n        {\r\n            \"apiVersion\": \"2015-06-15\",\r\n            \"type\": \"Microsoft.Compute\/virtualMachines\",\r\n            \"name\": \"[variables('vmName')]\",\r\n            \"location\": \"[resourceGroup().location]\",\r\n            \"tags\": {\r\n                \"displayName\": \"VirtualMachine\"\r\n            },\r\n            \"dependsOn\": [\r\n                \"[concat('Microsoft.Storage\/storageAccounts\/', variables('vhdStorageName'))]\",\r\n                \"[concat('Microsoft.Network\/networkInterfaces\/', variables('nicName'))]\"\r\n            ],\r\n            \"properties\": {\r\n                \"hardwareProfile\": {\r\n                    \"vmSize\": \"[variables('vmSize')]\"\r\n                },\r\n                \"osProfile\": {\r\n                    \"computerName\": \"[variables('vmName')]\",\r\n                    \"adminUsername\": \"[parameters('adminUsername')]\",\r\n                    \"adminPassword\": \"[parameters('adminPassword')]\"\r\n                },\r\n                \"storageProfile\": {\r\n                    \"imageReference\": {\r\n                        \"publisher\": \"[variables('imagePublisher')]\",\r\n                        \"offer\": \"[variables('imageOffer')]\",\r\n                        \"sku\": \"[parameters('windowsOSVersion')]\",\r\n                        \"version\": \"latest\"\r\n                    },\r\n                    \"osDisk\": {\r\n                        \"name\": \"osdisk\",\r\n                        \"vhd\": {\r\n                            \"uri\": \"[concat('http:\/\/', variables('vhdStorageName'), '.blob.core.windows.net\/', variables('vhdStorageContainerName'), '\/', variables('OSDiskName'), '.vhd')]\"\r\n                        },\r\n                        \"caching\": \"ReadWrite\",\r\n                        \"createOption\": \"FromImage\"\r\n                    }\r\n                },\r\n                \"networkProfile\": {\r\n                    \"networkInterfaces\": [\r\n                        {\r\n                            \"id\": \"[resourceId('Microsoft.Network\/networkInterfaces', variables('nicName'))]\"\r\n                        }\r\n                    ]\r\n                },\r\n                \"diagnosticsProfile\": {\r\n                    \"bootDiagnostics\": {\r\n                        \"enabled\": true,\r\n                        \"storageUri\": \"[concat('http:\/\/', variables('diagnosticsStorageAccountName'), '.blob.core.windows.net')]\"\r\n                    }\r\n                }\r\n            },\r\n            \"resources\": [\r\n                {\r\n                    \"type\": \"extensions\",\r\n                    \"name\": \"Microsoft.Insights.VMDiagnosticsSettings\",\r\n                    \"apiVersion\": \"2015-06-15\",\r\n                    \"location\": \"[resourceGroup().location]\",\r\n                    \"tags\": {\r\n                        \"displayName\": \"AzureDiagnostics\"\r\n                    },\r\n                    \"dependsOn\": [\r\n                        \"[concat('Microsoft.Compute\/virtualMachines\/', variables('vmName'))]\"\r\n                    ],\r\n                    \"properties\": {\r\n                        \"publisher\": \"Microsoft.Azure.Diagnostics\",\r\n                        \"type\": \"IaaSDiagnostics\",\r\n                        \"typeHandlerVersion\": \"1.5\",\r\n                        \"autoUpgradeMinorVersion\": true,\r\n                        \"settings\": {\r\n                            \"xmlCfg\": \"[base64(concat(variables('wadcfgxstart'), variables('wadmetricsresourceid'), variables('wadcfgxend')))]\",\r\n                            \"storageAccount\": \"[variables('diagnosticsStorageAccountName')]\"\r\n                        },\r\n                        \"protectedSettings\": {\r\n                            \"storageAccountName\": \"[variables('diagnosticsStorageAccountName')]\",\r\n                            \"storageAccountKey\": \"[listkeys(variables('accountid'), '2015-06-15').key1]\",\r\n                            \"storageAccountEndPoint\": \"https:\/\/core.windows.net\"\r\n                        }\r\n                    }\r\n                }\r\n            ]\r\n        }\r\n\r\nNote that the above code snippet defines a single virtual machine. Let us decode various sections of this complex resource:\r\n\r\n - It begins with simple properties like apiVersion, type, name, location and tags as discussed in the previous example. These are straightforward and thus values are provided to these attributes.\r\n - Next is the **dependsOn** section. This defines the dependency between resources. In the above example, the virtual machine resource is dependent on the storage account and a network interface, which are also defined in the template. These 2 resources will be created before the virtual machine creation\/deployment. If these resources are not created in the template then it will check for the presence of these resources in the current subscription. If they are not present the template will not get deployed and will error out.\r\n - Next are various **properties** to configure the Virtual machine, like hardware profile, os profile, storage profile, os disk, network profile, diagnostics profile etc.\r\n - Next, we have additional **sub-resources**. These are Azure resources which will be created and linked to the current resource. Only one sub-resource is created in the above example which is an extension for VM diagnostics settings.\r\n\r\nThat's all there is to Resources in ARM Templates. If you have any doubts, please comment in the below section. Use the links at the Top to know all about other components in an ARM Template.",
		"addpost": "addpost",
		"dated": "Aug 29, 2016",
		"slug": "step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-4-resources",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>If you haven't checked the previous blog ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - What is in an ARM Template - Understanding Components 3 - Variables",
		"postDate": "28-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIf you haven't checked the previous blog on the overall structure of the ARM template, I suggest you give it a quick read before checking the component described in this post in detail.\r\n\r\n 1. [Understanding all components](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-all-components\/)\r\n 2. [Parameters](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-2-parameters\/)\r\n 3. [Variables - This blog post](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-3-variables\/)\r\n 4. [Resources](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-4-resources\/)\r\n 5. [Outputs](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-5-outputs\/)\r\n\r\n## Variables ##\r\n\r\nVariables are values that you either know beforehand or you can construct from the input parameters. These variables can then be reused at multiple locations in the resources section. If you later want to change the value of a variable then it automatically gets updated at all other locations. They can be used to define a resource property.\r\n\r\n### Defining Variables ###\r\n\r\nVariable is a one huge JSON object. Each property can be one of the simple data type (like integer, bool, string etc.) or can be another complex JSON object. The general structure is as shown below:\r\n\r\n    \"variables\": {\r\n          \"variable 1\" : \"value 1\",\r\n          \"variable 2\" : \"value 2\",\r\n          \"variable 3\" : 1024,\r\n          \"variable 4\" : {}\r\n    }\r\n\r\nNote that in the above example, the first 3 variables are of simple value type. The 4rth variable is however of a complex JSON object type.\r\n\r\nLet's now check a real variables section from an actual ARM template:\r\n\r\n    \"variables\": {\r\n            \"vmSize\": \"Standard_A2\",\r\n            \"virtualNetworkName\": \"MyVNETName\",\r\n            \"vnetId1\": \"[resourceId('Microsoft.Network\/virtualNetworks', variables('virtualNetworkName'))]\",\r\n            \"vnetId2\": \"[resourceId(parameters('vNetRG'),'Microsoft.Network\/virtualNetworks',parameters('virtualNetworkName'))]\",\r\n            \"subnetRef\": \"[concat(variables('vnetId'), '\/subnets\/', variables('subnetName'))]\",\r\n            \"vhdStorageName\": \"[concat('vhdstorage', uniqueString(resourceGroup().id))]\",\r\n            \"storageAccountResourceGroup\": \"[resourcegroup().name]\",\r\n            \"location\": \"[resourceGroup().location]\",\r\n            \"subscriptionId\": \"[subscription().subscriptionId]\"\r\n        }\r\n\r\nThere are lots of key constructs in the above code snippet. I have tried to capture as many different constructs in this snippets as I could. Let us decode each variable one by one.\r\n\r\n 1. vmSize - Simple String\r\n 2. virtualNetworkName - Simple string name\r\n 3. vnetId1 - This uses a special function named \"**resourceId**\" to find out the resource ID of the virtual network. This function is invoked by using the syntax `\"[resourceId(Input)]\"` .  This gets the resource ID of a resource which is defined by the Input to this. Also, note the use of another variable as an input to this.\r\n 4. vnetId2 - This also fetches the resource Id of a virtual network using \"resourceId\" method. Note the use of the value of a parameter in this to find out Resource Group of the existing Virtual network (parameter \"vNetRG\").\r\n 5. subnetRef - This variable uses another function \"**concat**\" in ARM template i.e. `\"[concat(input1,input2,...)]\"`. This function can take many inputs and will concatinate (i.e. club together) the value of all the inputs provided. You can use parameters or another variable.\r\n 6. vhdStorageName - This also uses concat function to dynamically generate a storage name. However it uses \"**resourcegroup**\" function as `\"[resourcegroup()]\"`. This function always returns the resource group to which you are deploying the current ARM template. Then the variable uses the id property of the resource group returned.\r\n 7. storageAccountResourceGroup - This uses the \"name\" property of the current resource group\r\n 8. location - This uses the \"location\" property of the current resource group.\r\n 9. subscriptionId - This uses the \"**subscription**\" function as `\"[subscription()]\"` to find out the current subscription to which the current ARM template is being deployed.  Then it uses the subscription Id property of the subscription to get the required Id.\r\n\r\nNote that these constructs are very powerfull and can be used to dynamically construct your ARM template. These constructs are also known as Helper Functions and are explained in detail here: [Step by Step ARM Templates - Helper Functions](..\/step-by-step-arm-templates-helper-functions\/)\r\n\r\n### Using Variables ###\r\n\r\nUsing variables is very easy and is similar to using parameters. In fact, you already saw the usage of variables above, while defining other variables.\r\n\r\nYou use the square parenthesis to indicate to the ARM engine to evaluate whatever is inside the parenthesis. You use the \"variable\" keyword and then you pass the name of the variable as input. Check the example below.\r\n\r\n    \"storageAccountName\": \"[variables('storageAccountName')]\"\r\n\r\n### Best Practices ###\r\n\r\nBest practices are similar to the Parameters.\r\n\r\n - Provide complete descriptive names, no matter how long.\r\n - Use **Pascal Casing** to name your parameters. i.e. First letter should be a small letter. Then every new word will have the first letter as a capital. No space between words. E.g. storageAccountName\r\n - Use the constructs explained in the previous section to dynamically generate variables. This reduces any human errors.\r\n - Anything that is used more than once and is not required to be entered by an end user, should be created as a variable. Later on, this helps by minimizing the number of places you need to change the value.\r\n\r\nThat's all there is to Variables in ARM Templates. If you have any doubts, please comment in the below section. Use the links at the Top to know all about other components in an ARM Template.",
		"addpost": "addpost",
		"dated": "Aug 26, 2016",
		"slug": "step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-3-variables",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>If you haven't checked the previous blog ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - What is in an ARM Template - Understanding Components 2 - Parameters",
		"postDate": "22-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nIf you haven't checked the previous blog on the overall structure of the ARM template, I suggest you give it a quick read before checking the component described in this post in detail.\r\n\r\n 1. [Understanding all components](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-all-components\/)\r\n 2. [Parameters - This blog post](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-2-parameters\/)\r\n 3. [Variables](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-3-variables\/)\r\n 4. [Resources](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-4-resources\/)\r\n 5. [Outputs](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-5-outputs\/)\r\n\r\n## Parameters ##\r\nAs mentioned earlier, parameters are the way to customize the templates, each time you deploy it to create resources in Azure. These parameters are the end-user inputs for various aspects of the template. E.g. If you are deploying an Azure Virtual Machine via an ARM Template then the name of the VM can be an input parameter. Operating System type can be another parameter.\r\n\r\nThe parameters can be referred and used in other parts of the ARM Template.\r\n\r\n### 1. Defining Parameters ###\r\nParameters is a one huge JSON object with multiple JSON properties. Each property is one parameter which is represented as another JSON object. Let us look at its structure at a high level.\r\n\r\n    \"parameters\": {\r\n                   \"parameter 1\" : {},\r\n                   \"parameter 2\" : {},\r\n                   \"parameter 3\" : {}\r\n    }\r\n\r\nE.g. If you are creating a template to deploy a Windows Virtual Machine then the parameters will look something like below:\r\n\r\n    \"parameters\": {\r\n                   \"VMName\" : {},\r\n                   \"AdminUserName\" : {},\r\n                   \"AdminPassword\" : {},\r\n                   \"WindowsOSVersion\" : {}\r\n    }\r\n\r\nNow let us look at one of the parameters. E.g. The AdminUserName parameter will look like:\r\n\r\n    \"adminUsername\": {\r\n                \"type\": \"string\",\r\n                \"minLength\": 1,\r\n                \"metadata\": {\r\n                    \"description\": \"Username for the Virtual Machine.\"\r\n                }\r\n            }\r\n\r\nThe parameter object, as shown above, has following parts:\r\n 1. **Type** - This is the data Type of the parameter.\r\n 2. **minLength** - This is the minimum length the parameter must have\r\n 3. **Metadata** - This is just to provide a description as to what the parameter means.\r\n\r\nThe **Data Type** allowed for the parameter are:\r\n\r\n - string or secureString – any valid JSON string\r\n - int – any valid JSON integer\r\n - bool – any valid JSON boolean \r\n - object – any valid JSON object \r\n - array – any valid JSON array\r\n\r\nA more complex parameter e.g. Windows OS Version, with few more properties, is shown below:\r\n\r\n    \"windowsOSVersion\": {\r\n                \"type\": \"string\",\r\n                \"defaultValue\": \"2012-R2-Datacenter\",\r\n                \"allowedValues\": [\r\n                    \"2008-R2-SP1\",\r\n                    \"2012-Datacenter\",\r\n                    \"2012-R2-Datacenter\"\r\n                ],\r\n                \"metadata\": {\r\n                    \"description\": \"The Windows version for the VM. This will pick a fully patched image of this given Windows version. Allowed values: 2008-R2-SP1, 2012-Datacenter, 2012-R2-Datacenter.\"\r\n                }\r\n            }\r\n\r\nIt has additional below properties:\r\n\r\n 1. **Default Value** - This is the default value. End User will be able to change this value when deploying the template. If no value is provided then this value is picked.\r\n 2. **Allowed Values** - This is an Array of values which are allowed for the parameter. Only value from this set is allowed as an input.\r\n\r\n### 2. Using Parameters ###\r\n\r\nUsing parameters is easy. Wherever in your template (in variables or resources section) you want to use the value of a parameter, just use the parameter function as shown below with the name of the parameter as input, enclosed in square brackets. \r\n\r\n    [parameters('windowsOSVersion')]\r\n\r\nIf the parameter value is assigned to a property, enclosing it in double quotes, as shown below:\r\n\r\n    \"sku\": \"[parameters('windowsOSVersion')]\"\r\n\r\n### 3. Best Practices ###\r\n\r\n - Try to always provide Default Values\r\n - Provide metadata so that you can provide insight as to what the parameter is meant for\r\n - Provide complete descriptive names, no matter how long.\r\n - Use **Pascal Casing** to name your parameters. i.e. First letter should be a small letter. Then every new word will have the first letter as a capital. No space between words. E.g. windowsOSVersion\r\n - Use properties like minLength and Allowed values to impose restrictions. This reduces any human errors.\r\n\r\nThat's all there is to Parameters in ARM Templates. If you have any doubts, please comment in the below section. Use the links at the Top to know all about other components in an ARM Template.",
		"addpost": "addpost",
		"dated": "Aug 24, 2016",
		"slug": "step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-2-parameters",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>If you haven't checked the previous blog ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - What is in an ARM Template - Understanding All Components",
		"postDate": "23-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nAs we discussed [earlier in the introduction](..\/step-by-step-azure-resource-manager-arm-templates-index\/) **Azure Resource Manager (ARM) Template** is a JavaScript Object Notation (JSON) file that defines one or more resources to deploy to a resource group. It also defines the dependencies between the deployed resources.\r\n\r\nIn this post, we will deconstruct any basic ARM template and will understand it's various components.\r\n\r\nAny ARM Template will look like below:\r\n\r\n    {\r\n        \"$schema\": \"https:\/\/schema.management.azure.com\/schemas\/2015-01-01\/deploymentTemplate.json#\",\r\n        \"contentVersion\": \"1.0.0.0\",\r\n        \"parameters\": {},\r\n        \"variables\": {},\r\n        \"resources\": [ {}, {} ]\r\n    }\r\n\r\nSnapshot of the Template at root level, as generated via Visual Studio:\r\n\r\n![ARM Template Components][1]\r\n\r\n\r\n\r\nAs you can see the components (or properties) of any ARM template includes:\r\n\r\n 1. Schema\r\n 2. Content Version\r\n 3. Parameters\r\n 4. Variables\r\n 5. Resources\r\n\r\nLet's look at these in more detail.\r\n\r\n <table border=\"1\" cellpadding=\"4\" cellspacing=\"4\">\r\n        <colgroup>\r\n            <col>\r\n            <col>\r\n            <col>\r\n            <col>\r\n        <\/colgroup>\r\n        <tbody valign=\"top\">\r\n            <tr>\r\n                <th>Element name<\/th>\r\n                <th>Required<\/th>\r\n                <th>JSON Type<\/th>\r\n                <th>Description<\/th>\r\n            <\/tr>\r\n            <tr>\r\n                <td>$schema<\/td>\r\n                <td>Yes<\/td>\r\n                <td>String Value<\/td>\r\n                <td>Location of the JSON schema file that describes the version of the template language.<\/td>\r\n            <\/tr>\r\n            <tr>\r\n                <td>contentVersion<\/td>\r\n                <td>Yes<\/td>\r\n                <td>String Value<\/td>\r\n                <td>Version of the template (such as 1.2.0.20). When deploying resources using the template, this value can be used to make sure that the right template is being used.<\/td>\r\n            <\/tr>\r\n            <tr>\r\n                <td>parameters<\/td>\r\n                <td>No<\/td>\r\n                <td>JSON Object<\/td>\r\n                <td>Values that are provided by the end user (manually or via a parameters file) when deployment is executed to customize resource deployment.<\/td>\r\n            <\/tr>\r\n            <tr>\r\n                <td>variables<\/td>\r\n                <td>No<\/td>\r\n                <td>JSON Object<\/td>\r\n                <td>Values that are reused multiple times in the template. You can update these values. They are different from Parameters as their value is known and they are not required as inputs from the end user.<\/td>\r\n            <\/tr>\r\n            <tr>\r\n                <td>resources<\/td>\r\n                <td>Yes<\/td>\r\n                <td>Array of Objects<\/td>\r\n                <td>Types of services that are deployed or updated in a resource group. Each JSON object in this Array denotes an Azure Resource.<\/td>\r\n            <\/tr>\r\n            <tr>\r\n                <td>outputs<\/td>\r\n                <td>No<\/td>\r\n                <td>JSON Object<\/td>\r\n                <td>Values that are returned after deployment.<\/td>\r\n            <\/tr>\r\n        <\/tbody>\r\n<\/table>\r\n\r\nNow that you know what each part is at a high level, in the next posts, we will look at the key 4 components in detail.\r\n\r\n 1. [Parameters](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-2-parameters\/)\r\n 2. [Variables](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-3-variables\/)\r\n 3. [Resources](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-4-resources\/)\r\n 4. [Outputs](..\/step-by-step-arm-templates-what-is-in-an-arm-template-understanding-components-5-outputs\/)\r\n\r\n  [1]: http:\/\/HarvestingClouds.com\/images\/147520488857edd71873f9b.png",
		"addpost": "addpost",
		"dated": "Aug 22, 2016",
		"slug": "step-by-step-arm-templates-what-is-in-an-arm-template-understanding-all-components",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>As we discussed <a href=\"..\/step-by-step-...\"><\/a><\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Step by Step ARM Templates - JSON 101 for IT Administrators",
		"postDate": "17-08-2016",
		"tags": [
			"ARM",
			"Azure",
			"AzureResourceManager",
			"JSON",
			"Templates"
		],
		"category": "Azure",
		"body": "**Index** of all blogs in this **Step by Step ARM Templates series** is located here: [Step by Step Azure Resource Manager (ARM) Templates - Index](\/post\/step-by-step-azure-resource-manager-arm-templates-index\/)\r\n\r\nAzure Resource Manager (ARM) templates are written in JSON or **JavaScript Object Notation**. To understand ARM templates, you need to understand few quick basics about JSON. These will enable you to lay a great foundation which will enable you to understand ARM templates very easily.\r\n\r\nJSON or JavaScript Object Notation (pronounce like \"Jay-son\") is a text-based data format that's designed to be human-readable, lightweight, and easy to transmit between a server and a web client. Its syntax is derived from JavaScript. Think of this as an even more compact version of XML files.\r\n\r\nJSON is a popular notation for transmitting data through RESTful web services. The official internet media type for JSON is `application\/json`, and JSON files typically have a `.json` extension.\r\n\r\nTo understand JSON we need to understand **3 main components**. These components are like building blocks, using which you can build very complex JSON files.\r\n\r\n\r\n## 1. Objects ##\r\n\r\nObjects are the heart of JSON. Object denotes a real life object, e.g. an Employee. Just like a real life object, these have various properties and a value for each of these properties. E.g. An Employee will have Name property with value as John. Further, an employee object can have various another properties like Age, Salary, Department etc. So to denote an object in JSON you:\r\n\r\n - One object will be represented by curly brackets. It will begin from opening curly bracket i.e. `{` and will end at closing curly bracket i.e. `}`\r\n - Denote the property and corresponding values as `\"key\" : \"value\"` or `\"property\" : \"value\"` pairs.\r\n - You can only use double quotes for Properties as they will always be of type string\r\n - You will have double quotes around Values if they are of string type. You will not have any quotes in case of a number or a boolean value.\r\n - Each property will be separated from next property by a comma\r\n\r\n**Note:** Each JSON file is also a single JSON object. At root level it starts with an opening curly bracket i.e. `{` and will end with closing curly bracket i.e. `}`. There can't be any other objects at the root level. Think of this similar to how in an XML file there can be only one element at the root level. \r\n\r\nExample Employee object is shown below:\r\n\r\n    {\r\n        \"Name\" : \"John\",\r\n        \"Age\" : 34,\r\n        \"Department\" : \"Finance\",\r\n        \"Salary\" : \"100000\",\r\n        \"IsAdmin\" : true\r\n    }\r\n\r\n## 2. Arrays ##\r\n\r\nSimply put, arrays are a collection of items. In JSON the **square brackets** represents an Array. E.g. An array of 3 employees will look like below:\r\n\r\n    [\r\n      {\r\n            \"Name\" : \"John\",\r\n            \"Age\" : 34\r\n        },\r\n       {\r\n            \"Name\" : \"Mary\",\r\n            \"Age\" : 32\r\n        },\r\n       {\r\n            \"Name\" : \"Matthew\",\r\n            \"Age\" : 29\r\n        }\r\n    ]\r\n\r\n## 3. Nesting of Objects ##\r\nNow things get more interesting with nesting of Objects. What Nesting means is that one object can have it's property as another complex object. Don't worry if that sounds confusing. Let's understand that statement using an example. An Address where a person lives can be represented by an object. This object will look like below:\r\n\r\n    {\r\n      \"StreetNumber\" : \"50\",\r\n      \"StreetName\" : \"Brian Harrison Way\",\r\n      \"Unit Number\" : 22,\r\n      \"City\" : \"Toronto\",\r\n      \"Country\" : \"Canada\"\r\n    }\r\nNow an Employee Object will have an Address object as one of it's property (because employee need to live somewhere). This new complex Employee object will look like below, with nested Address object as one of it's property:\r\n\r\n     {\r\n            \"Name\" : \"John\",\r\n            \"Age\" : 34,\r\n            \"Department\" : \"Finance\",\r\n            \"Salary\" : \"100000\",\r\n            \"IsAdmin\" : true,\r\n            \"Address\" :   {\r\n                              \"StreetNumber\" : \"50\",\r\n                              \"StreetName\" : \"Brian Harrison Way\",\r\n                              \"Unit Number\" : 22,\r\n                              \"City\" : \"Toronto\",\r\n                              \"Country\" : \"Canada\"\r\n                           }\r\n        }\r\n\r\nThat's all there is to it. Now you can use these 3 components and build very complex json files\/templates. Even the most complex template can be broken into these 3 components. \r\n\r\nBelow is a complex example with all 3 components. \r\n\r\n    {\r\n        \"Department\": \"Finance\",\r\n        \"TotalEmployees\": 2,\r\n        \"Employees\": [\r\n            {\r\n                \"Name\": \"John\",\r\n                \"Age\": 34,\r\n                \"Department\": \"Finance\",\r\n                \"Salary\": \"100000\",\r\n                \"IsAdmin\": true,\r\n                \"Address\": {\r\n                    \"StreetNumber\": \"50\",\r\n                    \"StreetName\": \"Brian Harrison Way\",\r\n                    \"Unit Number\": 22,\r\n                    \"City\": \"Toronto\",\r\n                    \"Country\": \"Canada\"\r\n                }\r\n            },\r\n            {\r\n                \"Name\": \"John\",\r\n                \"Age\": 34,\r\n                \"Department\": \"Finance\",\r\n                \"Salary\": \"100000\",\r\n                \"IsAdmin\": true,\r\n                \"Address\": {\r\n                    \"StreetNumber\": \"50\",\r\n                    \"StreetName\": \"Brian Harrison Way\",\r\n                    \"Unit Number\": 22,\r\n                    \"City\": \"Toronto\",\r\n                    \"Country\": \"Canada\"\r\n                }\r\n            }\r\n        ]\r\n    }\r\n\r\nThe above JSON object denotes one department with name as Finance and total number of employees as 2. Then the \"Employees\" object is an array of 2 emplyees. Each emplyee object further have a complex property as Address, which is another object. \r\n\r\nIf you understood each of the 3 components, you should be able to build\/understand most complex JSON files with ease.",
		"savedraft": "savedraft",
		"dated": "Aug 17, 2016",
		"slug": "step-by-step-arm-templates-json-101-for-it-administrators",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Index<\/strong> of all blogs in this <strong>Step by Step ARM Templates series<\/strong> is located here: <a href=\"\/post\/step-by-step-azure-resource-manager-arm-templates-index\/\">Step by Step Azure Resource Manager (ARM) Templates - Index<\/a><\/p>\n<p>Azure Resource Manager (ARM) templates ar...<\/p>\n",
		"addpost": "addpost",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "ASR Setup for VMs running in VMWare without VMware level User Access",
		"postDate": "27-07-2016",
		"tags": [
			"ASR",
			"Azure",
			"AzureSiteRecovery",
			"VMWare"
		],
		"category": "Azure",
		"body": "### Problem Statement\r\nRecently I was setting up **Azure Site Recovery** (or ASR) in an environment. We had multiple VMs in VMWare environment. The environment was managed by Third Party who did not want to give any service account for VMWare as their environment was shared with different customers. So we had access only to the VMs. Without relevant access, ASR for VMWare was out of the question for us.\r\n\r\n### Solution\r\nWe treated the VMs, in such environment, as physical machines when setting up ASR to replicate these machines to Azure. \r\nWe used the option of \"***Not virtualized\/other***\" in the \"***Prepare Infrastructure***\" wizard of ASR. We **treated the VMs as physical servers** and did not face any issues during the migration. \r\n\r\nRefer below screenshot for the exact option discussed above.\r\n\r\n![Protection Goal][1]\r\n\r\n\r\nLater when enabling the Replication for any Server, run the \"***Enable Replication***\" wizard by clicking on \"**+Replicate**\" on the ASR vault's blade. Then select \"**Machine Type**\" as \"***Physical Machine***\" and add the Physical Machines by mentioning their IP addresses. \r\n\r\n**Note:** For this approach to work, the Configuration server should be on the same network as the VM being considered as Physical Machine.\r\n\r\n\r\nWe were able to migrate many servers successfully and without any issues using this approach.\r\n\r\n\r\n  [1]: http:\/\/HarvestingClouds.com\/images\/14696297155798c513ea908.png",
		"addpost": "addpost",
		"dated": "Jul 26, 2016",
		"slug": "asr-setup-for-vms-running-in-vmware-without-vmware-level-user-access",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<h3>Problem Statement<\/h3>\n<p>Recently I was setting up <strong>Azure Site Recovery<\/strong> (or ASR) in an environment. We had multiple VMs in VMWare environment. The environment was managed by Third Party who did not want to give any service account for VMWare as their environment was shared with ...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Uploading and Downloading files securely from Azure Storage Blob via PowerShell",
		"postDate": "18-05-2016",
		"tags": [
			"azure",
			"blob",
			"powershell",
			"storage"
		],
		"category": "Azure",
		"body": "**Azure blob storage** can provide a very highly available way to store your files in the cloud. You can dynamically add or remove the files in an automated fashion. These files can then be used for any number of purposes. E.g. A parameter file for ARM template can be kept in Azure blob storage and then dynamically read while creating resources from an ARM template.\r\n\r\n**The whole process can be broken down into 3 parts**:\r\n\r\n 1. Generating the context to the storage container\r\n 2. Uploading the files using the context\r\n 3. Downloading the files using the context\r\n\r\n### 1. Generating the context to the storage container\r\nThe context to the storage blob container can be created in one of the 3 ways, based on your security requirements. All methods use the `New-AzureStorageContext` cmdlet to generate the storage context. The methods differ on how you pass the parameters to this cmdlet.\r\n\r\n**A. Via fetching the Azure Storage Key**\r\n\r\nThis first method uses the `Get-AzureStorageKey` to fetch the storage key. This key is then used to generate the context as shown below.\r\n\r\n    $StorageAccountName = \"yourstorageaccount\"\r\n    $StorageAccountKey = Get-AzureStorageKey -StorageAccountName $StorageAccountName\r\n    $Ctx = New-AzureStorageContext $StorageAccountName -StorageAccountKey $StorageAccountKey.Primary\r\n\r\n**B. Via fetching the Azure Storage Container SAS Token**\r\n\r\nThis second method uses the `New-AzureStorageContainerSASToken` to create a new SAS token to securely access the storage container. This token is then used to generate the context as shown below.\r\n\r\n    $sasToken = New-AzureStorageContainerSASToken -Container abc -Permission rl\r\n    $Ctx = New-AzureStorageContext -StorageAccountName $StorageAccountName -SasToken $sasToken\r\n\r\n**C. Via Connectin String**\r\n\r\nThis third method uses a connection string, entered manually, which is then used to generate the context as shown below.\r\n\r\n    $ConnectionString = \"DefaultEndpointsProtocol=http;BlobEndpoint=<blobEndpoint>;QueueEndpoint=<QueueEndpoint>;TableEndpoint=<TableEndpoint>;AccountName=<AccountName>;AccountKey=<AccountKey>\"\r\n    $Ctx = New-AzureStorageContext -ConnectionString $ConnectionString\r\n\r\n### 2. Uploading the files using the context\r\n\r\nNow that you have the context to the storage account you can upload and download files from the storage blob container.\r\nUse the below code to upload a file named \"_Parameters.json_\", located on the local machine at \"_C:\\Temp_\" directory.\r\n\r\n    #Uploading File\r\n    $BlobName = \"Parameters.json\"\r\n    $localFile = \"C:\\Temp\\\" + $BlobName\r\n    $ContainerName  = \"vhds\"\r\n\r\n    #Note the Force switch will overwrite if the file already exists in the Azure container\r\n    Set-AzureStorageBlobContent -File $localFile -Container $ContainerName -Blob $BlobName -Context $Ctx -Force\r\n\r\n### 3. Downloading the files using the context\r\n\r\nDownload works in almost identical manner. You use the Get cmdlet instead of Set as shown below to download a file to a local folder, located at \"_C:\\Downloads_\".\r\n\r\n    #Download File\r\n    $BlobName = \"Parameters.json\"\r\n    $localTargetDirectory = \"C:\\Downloads\"\r\n    $ContainerName  = \"vhds\"\r\n\r\n    Get-AzureStorageBlobContent -Blob $BlobName -Container $ContainerName -Destination $localTargetDirectory -Context $ctx\r\n\r\nI hope this helps simplify the automated usage of Azure Storage container. Let us know your concerns or questions if any.\r\n\r\nYou can find the **complete sample** at the below link on GitHub. Right-click and select Save As to save the file: [StorageAccountBlobManagement.ps1](https:\/\/raw.githubusercontent.com\/HarvestingClouds\/PowerShellSamples\/master\/Scripts\/StorageAccountBlobManagement.ps1)\r\n\r\n**Reference:** <a href=\"https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/storage-powershell-guide-full\/\" target=\"_blank\">Using Azure PowerShell with Azure Storage<\/a>",
		"addpost": "addpost",
		"dated": "May 18, 2016",
		"slug": "uploading-and-downloading-files-securely-from-azure-storage-blob-via-powershell",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p><strong>Azure blob storage<\/strong> can provide a very highly available way to store your files in the cloud. You can dynamically add or remove the files in an automated fashion. These files can then be used for any number of purposes. E.g. A parameter file for ARM template can be kept in Azure b...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Azure comes to Canada (along with Office 365)",
		"postDate": "16-05-2016",
		"tags": [
			"azure",
			"datacenter"
		],
		"category": "Azure",
		"body": "Last week marked the general availability of Azure datacenter for Canada locations. Also Office 365 has been released last week. Microsoft has set up 2 new datacenters in Canada. \r\n\r\n### Where Exactly are these datacenters located\r\n\r\n 1. **Canada Central** - The first datacenter is located in Toronto.\r\n 2. **Canada East** - The second datacenter is located in Quebec City.\r\n\r\nNow when you are creating a new resource (like a Virtual Machine) you will see these two options.\r\n\r\n![New Locations](http:\/\/HarvestingClouds.com\/images\/1463686879573e16df4f64c.png)\r\n\r\nCheck out the brief announcement video by **Janet Kennedy**, President of Microsoft Canada:\r\n<iframe src=\"https:\/\/channel9.msdn.com\/Blogs\/CANITPRO\/The-Microsoft-Canada-Cloud-is-Open-for-Business\/player\" width=\"560\" height=\"315\" allowFullScreen frameBorder=\"0\"><\/iframe>\r\n\r\n### Key Resources:\r\n\r\n - These locations are also listed in the official Microsoft Regions list here: <a href=\"https:\/\/azure.microsoft.com\/en-us\/regions\/#services?WT.mc_id=azurebg_email_Trans_1106_Tier2_Release_MOSP\" target=\"_blank\">Azure Regions<\/a>\r\n - Various resources and information for cloud in Canada are available here at <a href=\"https:\/\/www.microsoft.com\/en-ca\/sites\/datacentre\/default.aspx\" target=\"_blank\">Cloud Accelerate site for Canada<\/a>.\r\n - You can read about this announcement and upcoming features here: <a href=\"https:\/\/azure.microsoft.com\/en-us\/blog\/microsoft-cloud-accelerates-in-canada-and-expands-to-south-korea\/?WT.mc_id=azurebg_email_Trans_1106_Tier2_Release_MOSP\" target=\"_blank\">Microsoft Cloud accelerates in Canada and expands to South Korea<\/a>",
		"addpost": "addpost",
		"dated": "May 16, 2016",
		"slug": "azure-comes-to-canada-along-with-office-365",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Last week marked the general availability of Azure datacenter for Canada locations. Also Office 365 has been released last week. Microsoft has set up 2 new datacenters in Canada. <\/p>\n<h3>Where Exactly are these datacenters located<\/h3>\n<ol><li><strong>Canada Central<\/strong> - The first datacen...<\/li><\/ol>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "NEW Feature - Azure Cool Blob Storage",
		"postDate": "02-05-2016",
		"tags": [
			"announcement",
			"azure",
			"storage"
		],
		"category": "Azure",
		"body": "Have you heard about the new **Azure Cool Blob Storage**? \r\n\r\nIf you haven’t heard about it, this is Microsoft's low-cost storage for **Cool** object data. “Example use cases for cool storage include backups, media content, scientific data, compliance and archival data. In general, any data which lives for a longer period of time and is accessed less than once a month is a perfect candidate for cool storage.” It is similar to what **Glacier storage tier** provides in Amazon Web Services.\r\n\r\n - **Pricing:** Its cost is as low as $0.01\/GB.\r\n - **Availability:** 99% (as compared to 99.9% for Hot Storage). With Read-access geo-redundant storage (or RA-GRS) the SLA is 99.9% (as compared to 99.99% for Hot).\r\n - **Deciding which AccessTier to use:** If the objects in the storage account will be more frequently accessed, then go with **Hot Tier**. Select the **Cold Tier** for infrequently accessed data.\r\n\r\nNow when you go to New -> \"Data + Storage\" -> Storage Account, and try to create a Blob Storage account then you can select from one of the options for **Access Tier** from Cold or Hot tier. \r\n\r\n![Storage Tiers][1]\r\n\r\nAlso, note that at the time of this writing, Blob storage account is **only available in these locations**: Central US, East US 2, North Central US, North Europe, West Europe, Southeast Asia, Japan East, Japan West, Central India, South India, West India.\r\n\r\n**Resources to know more:**  \r\n\r\n - <a href=\"https:\/\/azure.microsoft.com\/en-us\/blog\/introducing-azure-cool-storage\/\" target=\"_blank\">Official Announcement<\/a>\r\n - <a href=\"https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/storage-blob-storage-tiers\/\" target=\"_blank\">Getting started guide<\/a>\r\n\r\n\r\n  [1]: http:\/\/HarvestingClouds.com\/images\/146232375357294a2980ece.png",
		"addpost": "addpost",
		"dated": "May 02, 2016",
		"slug": "new-feature-azure-cool-blob-storage",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Have you heard about the new <strong>Azure Cool Blob Storage<\/strong>? <\/p>\n<p>If you haven&rsquo;t heard about it, this is Microsoft's low-cost storage for <strong>Cool<\/strong> object data. &ldquo;Example use cases for cool storage include backups, media content, scientific data, compliance and...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Taking Automatic Remediation Action on Azure VM Alert Generation",
		"postDate": "27-04-2016",
		"tags": [
			"automation",
			"azure",
			"azureautomation",
			"virtualmachine",
			"vm"
		],
		"category": "Azure",
		"body": "Using a new feature in Azure, now you can easily configure to trigger an Azure Automation Runbook when an Alert is triggered on an Azure Virtual Machine to take a remediation action. To leverage this feature all you need to do is link the alert on Azure VM to an already existing Azure Automation Runbook.\r\n\r\n > Note: This feature is supported only for the V2 Virtual Machines, i.e. the VMs created using ARM portal.\r\n\r\nTo access this feature open your Virtual Machine. Then go to the Manage alerts section in the Settings:\r\n\r\n![Setting - Manage alerts][1]\r\n\r\nThen open an existing alert or click on \"Add alert\" to create a new one. Specify the criteria for the alert. Scroll down to the bottom and you can view the new section to link the alert to an Automation Runbook.\r\n\r\n![Automation Runbook for Alert][2]\r\n\r\n###Under the hood\r\nThe alert will send data to your Runbook in a special format. Your Runbook should be expecting this. Under the hood this happens via WebHooks. The alert data is passed via a HTTP POST request. The Automation webhook service extracts the alert data from the POST request and passes it to the runbook in a parameter called **\"WebhookData\"**. The Runbook will look like below:\r\n\r\n    [OutputType(\"PSAzureOperationResponse\")]\r\n    \r\n    param ( [object] $WebhookData )\r\n    \r\n    if ($WebhookData)\r\n    {\r\n        # Get the data object from WebhookData\r\n        $WebhookBody = (ConvertFrom-Json -InputObject $WebhookData.RequestBody)\r\n\r\n        #Rest of the script comes here\r\n    }\r\n\r\n**In Nutshell**, now you can now trigger Azure Automation Runbooks to take remediation actions on Virtual Machines in case an alert is triggered. \r\n\r\n**Reference with complete Runbook sample:** [Azure Automation solution - remediate Azure VM alerts](https:\/\/azure.microsoft.com\/en-us\/documentation\/articles\/automation-azure-vm-alert-integration\/)\r\n\r\n\r\n  [1]: http:\/\/HarvestingClouds.com\/images\/14618976705722c9c653752.png\r\n  [2]: http:\/\/HarvestingClouds.com\/images\/14618990795722cf4763dce.png",
		"savedraft": "savedraft",
		"dated": "Apr 27, 2016",
		"slug": "taking-automatic-remediation-action-on-azure-vm-alert-generation",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Using a new feature in Azure, now you can easily configure to trigger an Azure Automation Runbook when an Alert is triggered on an Azure Virtual Machine to take a remediation action. To leverage this feature all you need to do is link the alert on Azure VM to an already existing Azure Automation ...<\/p>\n",
		"addpost": "addpost",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "ROADMAP - Solutions to help with Migration from Azure ASM to ARM portal",
		"postDate": "22-04-2016",
		"tags": [
			"announcement",
			"arm",
			"asm",
			"azure",
			"azureresourcemanager",
			"azureservicemanagement"
		],
		"category": "Azure",
		"body": "In additional to the tool I mentioned yesterday regarding [Migrating from Azure ASM to ARM portal](http:\/\/harvestingclouds.com\/Migrating-from-Azure-ASM-to-ARM-portal) there are various solutions in the pipeline. This post looks at the high level Roadmap for the same from Microsoft.\r\n\r\nMicrosoft has promised that they are committed to make the migration more easier from ASM (older) to ARM (newer) portal. Various solutions are already in the pipeline for this.\r\nBelow are the details and roadmap for the tentative timelines for these solutions.\r\n\r\n<table border=\"1\" cellpadding=\"0\" cellspacing=\"0\"> <tbody> <tr> <td valign=\"top\" width=\"29%\"> <p><b>Solution<\/b><\/p> <\/td> <td valign=\"top\" width=\"51%\"> <p><b>Customer Experience<\/b><\/p> <\/td> <td valign=\"top\" width=\"18%\"> <p><b>Expected availability in 2016<\/b><\/p> <\/td> <\/tr> <tr> <td valign=\"top\" width=\"29%\"> <p>Script migration<\/p> <\/td> <td valign=\"top\" width=\"51%\"> <p>VM is rebooted as it is recreated in the Resource Manager model. While the Virtual Machines for the environment are recreated, the network is disconnected.<\/p> <\/td> <td valign=\"top\" width=\"18%\"> <p align=\"center\">Q1<\/p> <\/td> <\/tr> <tr> <td valign=\"top\" width=\"29%\"> <p>Virtual Machines, no VNET<\/p> <\/td> <td valign=\"top\" width=\"51%\"> <p>As all Virtual Machines deployed in the Resource Manager model must be in a VNet, Virtual Machines will be migrated and placed in a new VNET. This will result in a change in network configuration, requiring a reboot to reconnect.<\/p> <\/td> <td valign=\"top\" width=\"18%\"> <p align=\"center\">Q2<\/p> <\/td> <\/tr> <tr> <td valign=\"top\" width=\"29%\"> <p>Virtual Machines with VNET<\/p> <\/td> <td valign=\"top\" width=\"51%\"> <p>Starting in Q2, the platform will offer Virtual Machine migration from ASM to Resource Manager model without disrupting the running Virtual Machine. This will require disconnecting any VNets connected on-premises, whether via ExpressRoute or VPN, before doing the migration.<\/p> <\/td> <td valign=\"top\" width=\"18%\"> <p align=\"center\">Q2<\/p> <\/td> <\/tr> <tr> <td valign=\"top\" width=\"29%\"> <p>Virtual Machines with basic hybrid (one connection)<\/p> <\/td> <td valign=\"top\" width=\"51%\"> <p>Starting in Q3, the platform will offer Virtual Machine migration from ASM to Resource Manager model without disrupting the running Virtual Machine and with minimal disruption to a basic hybrid connection, limited to just one connection back on-premises. More complex connections will require disconnecting before doing the migration.<\/p> <\/td> <td valign=\"top\" width=\"18%\"> <p align=\"center\">Q3<\/p> <\/td> <\/tr> <\/tbody> <\/table>\r\n\r\nReference: [Transitioning to the Resource Manager model](https:\/\/azure.microsoft.com\/en-us\/blog\/transitioning-to-the-resource-manager-model\/)",
		"addpost": "addpost",
		"dated": "Apr 22, 2016",
		"slug": "roadmap-solutions-to-help-with-migration-from-azure-asm-to-arm-portal",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>In additional to the tool I mentioned yesterday regarding <a href=\"http:\/\/harvestingclouds.com\/Migrating-from-Azure-ASM-to-ARM-portal\">Migrating from Azure ASM to ARM portal<\/a> there are various solutions in the pipeline. This post looks at the high level Roadmap for the same from Microsoft.<\/p>...\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Migrating from Azure ASM to ARM portal",
		"postDate": "21-04-2016",
		"tags": [
			"arm",
			"asm",
			"azure",
			"azureresourcemanager",
			"azureservicemanagement"
		],
		"category": "Azure",
		"body": "With co-existing Azure Service Management or ASM portal (older) and Azure Resource Manager or ARM portal (newer) there has been lots of confusions and problems for IT administrators.\r\nThe bottom line of all the discussion around the two portals is that **ARM is the future and is here to stay**. It means that you need to **plan and migrate** your resources from ASM portal to the ARM portal.\r\n\r\nThe key resource is your infrastructure which primarily consists of virtual machines. To migrate a single Virtual Machine (VM) from ASM portal to ARM portal you can leverage a set of PowerShell scripts called ASM2ARM.\r\nYou can download these scripts and check their description on [GitHub here on the **ASM2ARM** page](https:\/\/github.com\/fullscale180\/asm2arm). You can check the detailed instructions there too.\r\n\r\nTo plan this right now is very important as the transitioning to Azure Resource Manager model is already underway. Any future development and investment seems to be happening only in the newer portal only.\r\n\r\n**Reference:** [ASM2ARM scripts on GitHub](https:\/\/github.com\/fullscale180\/asm2arm)",
		"addpost": "addpost",
		"dated": "Apr 21, 2016",
		"slug": "migrating-from-azure-asm-to-arm-portal",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>With co-existing Azure Service Management or ASM portal (older) and Azure Resource Manager or ARM portal (newer) there has been lots of confusions and problems for IT administrators.\nThe bottom line of all the discussion around the two portals is that <strong>ARM is the future and is here to stay...<\/strong><\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "PowerShell DSC - Partial Configurations",
		"postDate": "20-04-2016",
		"tags": [
			"dsc",
			"powershell"
		],
		"category": "PowerShell",
		"body": "**Partial Configurations** is a new feature in PowerShell 5.0 Desired State Configuration or DSC. It allows the configurations to be delivered in parts or fragments. These configurations can come from various sources.\r\nThe Local Configuration Manager or LCM on the target node puts these partial configurations from different sources together and after that apply the same as a single configuration.\r\n\r\nThis opens various possibilities for Enterprises to manage their infrastructure and designate the responsibility to various teams for a single node. The team expert in a particular field can focus on that feature without worrying about other features.\r\n\r\nYou can have partial configurations in following modes:\r\n\r\n 1. Push Mode\r\n 2. Pull Mode\r\n 3. Hybrid Mode (i.e. combination of Push and Pull)\r\n \r\n### Configuration for the PUSH Mode\r\n\r\nYou need to follow three steps to configure Partial configurations for the PUSH mode:\r\n\r\n - Configure the LCM, on the target node, to expect partial configurations\r\n - Push each partial configuration from different sources using **Publish-DSCConfiguration** cmdlet. Target node will automatically combine the partial configurations into single configuration.\r\n - Apply the configuration by calling the **Start-DSCConfiguration**cmdlet\r\n \r\n### Configuration for the PULL Mode\r\n\r\nThis is bit complex than the Push mode. In nutshell you only need couple of steps:\r\n\r\n - Configure the LCM, on the target node, to receive partial configurations but from PULL servers\r\n - Name and locate the configuration documents properly on the pull servers\r\n \r\nTo know more about DSC Partial configurations follow the below references:\r\n\r\n   - [Detailed Blog by AutomationNext with very valuable insights](https:\/\/automationnext.wordpress.com\/2016\/04\/19\/powershell-desired-state-configuration-partial-configurations-without-configurationid\/)\r\n   - [Official MSDN Article](https:\/\/msdn.microsoft.com\/en-us\/powershell\/dsc\/partialconfigs)",
		"addpost": "addpost",
		"dated": "Apr 20, 2016",
		"slug": "powershell-dsc-partial-configurations",
		"categoryslug": "powershell",
		"status": "publised",
		"summary": "\n<p><strong>Partial Configurations<\/strong> is a new feature in PowerShell 5.0 Desired State Configuration or DSC. It allows the configurations to be delivered in parts or fragments. These configurations can come from various sources.\nThe Local Configuration Manager or LCM on the target node puts the...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Azure Container Service hits General Availability",
		"postDate": "19-04-2016",
		"tags": [
			"azure",
			"general"
		],
		"category": "Azure",
		"body": "Azure Container Service has finally hit General Availability today. \r\n\r\nIf you don't know already, it is the \"container hosting solution\" which is optimized for Microsoft's Azure cloud.\r\nAll the tools that you may be familiar with when working with a Container Service should work like Apache Mesos or Docker Swarm. It only uses open source components in the orchestration layers to give you portability of full applications.\r\n\r\nYou can find the announcement here: [GA for Azure Container Service](https:\/\/azure.microsoft.com\/en-us\/updates\/general-availability-azure-container-service\/)\r\n\r\nYou can learn more about the Container Service as offered by Azure on the product page here: [Azure Container Service](https:\/\/azure.microsoft.com\/en-us\/services\/container-service\/)\r\n",
		"addpost": "addpost",
		"dated": "Apr 19, 2016",
		"slug": "azure-container-service-hits-general-availability",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Azure Container Service has finally hit General Availability today. <\/p>\n<p>If you don't know already, it is the \"container hosting solution\" which is optimized for Microsoft's Azure cloud.\nAll the tools that you may be familiar with when working with a Container Service should work lik...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Azure Authentication - Authenticating any Azure API Request in your Application",
		"postDate": "15-04-2016",
		"tags": [
			".net",
			"azure",
			"csharp"
		],
		"category": "Azure",
		"body": "I have created a code sample to showcase how you can authenticate any request programatically with Azure. \r\nThis also contains **a Reusable Authentication Helper class** which you can directly use in your code.\r\n\r\n### Where is the code\r\n\r\nYou can find the complete code sample along with the reusable Azure Authentication Helper class library from this GitHub repo:\r\n[Azure Authentication Sample](https:\/\/github.com\/HarvestingClouds\/AzureAuthentication)\r\n\r\n### What are my authentication Options\r\n\r\nYou have the following options\r\n\r\n - Authenticating by **Prompting** for Credentials from end user. (This needs end user interaction)\r\n - Authenticating by **Credentials** i.e. using a password. (This does not need any end user interaction)\r\n - Authenticating by using a **Certificate** ( This also does not need any end user interaction)\r\n\r\nI have provided this functionality in 3 separate methods, in a separate class file along with it's interface. \r\nYou can follow the instructions in the ReadMe file in the GitHub repo and start using any one of the method.\r\n\r\nI hope you find this usefull and this will avoid the trouble of figuring things out, which I have already undergone. \r\n\r\nLet me know in the comments below if you have any questions or anything to add to this.",
		"addpost": "addpost",
		"dated": "Apr 15, 2016",
		"slug": "azure-authentication-authenticating-any-azure-api-request-in-your-application",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>I have created a code sample to showcase how you can authenticate any request programatically with Azure.\nThis also contains <strong>a Reusable Authentication Helper class<\/strong> which you can directly use in your code.<\/p>\n<h3>Where is the code<\/h3>\n<p>You can find the complete code sample alo...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Run Azure Automation Runbooks via PowerShell ISE",
		"postDate": "14-04-2016",
		"tags": [
			"automation",
			"azure",
			"powershell"
		],
		"category": "Azure",
		"body": "Today I came across this blog post from my friend: [Azure Automation PowerShell ISE add-on](https:\/\/scomanswers.wordpress.com\/2016\/04\/11\/azure-automation-powershell-ise-add-on\/)\r\n\r\nWhat I came to know is that now you can Run the Azure Automation Runbooks via PowerShell ISE. This solves a big pain point for all Azure developers.\r\nNow you will be able to develop and test your scripts right from the convenience of your laptop's local PowerShell ISE. \r\n\r\n### What you need to do\r\nAll you need to do is install the PowerShell Add-On using the below cmdlet:\r\n\r\n```powershell\r\nFind-Module AzureAutomationAuthoringToolkit | Install-Module -Scope CurrentUser\r\n```\r\n\r\nThen import the module using below cmdlet:\r\n\r\n```powershell\r\nImport-Module AzureAutomationAuthoringToolkit\r\n```\r\n\r\nYou can configure the Add-On using a Configuration tab in the add-on and start getting your hands dirty. \r\n\r\n### Official Information from the Add-On Help\r\n\r\n#### Capabilities\r\n\r\n - Test runbooks on your local machine and in the Azure Automation service: \r\n - Store and edit Automation Assets locally \r\n - Use Automation Activities (Get-AutomationVariable, Get-AutomationPSCredential, etc) in local PowerShell scripts \r\n - Sync changes back to your Automation Account \r\n - Run test jobs in Automation and view results \r\n\r\n#### Notes\r\nAssets\r\n\r\n - Secret values (passwords, encrypted variables) are not downloaded automatically; they need to be set manually the first time the account is synced \r\n - Values that haven't been downloaded will be highlighted \r\n - Asset values you enter locally will not get overwritten when you sync from the cloud \r\n\r\nRunbooks \r\n\r\n - Native PowerShell and PowerShell Workflow runbooks are supported \r\n\r\nCheck the screenshot regarding this information below:\r\n![Official Notes](http:\/\/HarvestingClouds.com\/images\/1461735632572050d069253.png \"Official Notes\")\r\n\r\n### How much time it would take me\r\nIn all it would take you under 10 mins to get setup and rolling.\r\n\r\n### Where is more information on this and screenshots\r\nGo to the official [Technet blog by clicking HERE.](https:\/\/blogs.technet.microsoft.com\/msoms\/2016\/04\/08\/the-way-cool-azure-automation-powershell-ise-add-on\/)\r\n\r\nStart playing around and let us know your initial impression in the comments below. If you have any doubts and I will be happy to address them.",
		"addpost": "addpost",
		"dated": "Apr 14, 2016",
		"slug": "run-azure-automation-runbooks-via-powershell-ise",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Today I came across this blog post from my friend: <a href=\"https:\/\/scomanswers.wordpress.com\/2016\/04\/11\/azure-automation-powershell-ise-add-on\/\">Azure Automation PowerShell ISE add-on<\/a><\/p>\n<p>What I came to know is that now you can Run the Azure Automation Runbooks via PowerShell ISE. This so...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Various Options Added to Buy Microsoft Azure Active Directory Basic",
		"postDate": "13-04-2016",
		"tags": [
			"azure",
			"general",
			"ad",
			"activedirectory"
		],
		"category": "Azure",
		"body": "Today Microsoft announced that they have added various options to buy Microsoft Azure Active Directory (AAD) Basic. \r\nYou can now buy it through the Direct program as well as through following options:\r\n\r\n - [Microsoft Enterprise Agreement](https:\/\/www.microsoft.com\/en-us\/licensing\/licensing-programs\/enterprise.aspx?WT.mc_id=azurebg_email_Trans_1065_Tier2_Release_MOSP)\r\n - [Open Volume License Program](https:\/\/www.microsoft.com\/en-us\/licensing\/licensing-programs\/open-license.aspx?WT.mc_id=azurebg_email_Trans_1065_Tier2_Release_MOSP)\r\n - [Microsoft Cloud Solution Provider](https:\/\/partner.microsoft.com\/en-US\/Solutions\/cloud-reseller-overview?WT.mc_id=azurebg_email_Trans_1065_Tier2_Release_MOSP)\r\n\r\nTo purchase, sign in to the [Office 365 Administration Portal](https:\/\/portal.office.com)\r\n\r\nYou can also watch the below video for details. Although the video is for AAD Premium, the steps are essentially similar for AAD Basic.\r\n<iframe src=\"https:\/\/channel9.msdn.com\/Series\/Azure-Active-Directory-Videos-Demos\/How-to-Purchase-Azure-Active-Directory-Premium-Existing-Customer\/player\" width=\"560\" height=\"315\" allowFullScreen frameBorder=\"0\"><\/iframe>\r\n\r\nYou can also engage a partner to assist you with the purchase and your Azure Active Directory related any requirements. \r\n[Infront Consulting Group](http:\/\/www.infrontconsulting.com\/) (where I currently work) is one such partner who are highly respected in market and are Microsoft Gold Certified Partner. \r\n\r\nThanks for reading! If you have any questions please ask in the comments below.",
		"addpost": "addpost",
		"dated": "Apr 13, 2016",
		"slug": "various-options-added-to-buy-microsoft-azure-active-directory-basic",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Today Microsoft announced that they have added various options to buy Microsoft Azure Active Directory (AAD) Basic.\nYou can now buy it through the Direct program as well as through following options:<\/p>\n<ul><li><a href=\"https:\/\/www.microsoft.com\/en-us\/licensing\/licensing-programs\/enterprise.asp...\"><\/a><\/li><\/ul>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Multiple Values In Grid.Mvc Single Column Filter via Checkboxes with Code Sample",
		"postDate": "12-04-2016",
		"tags": [
			"csharp",
			"gridmvc",
			"mvc",
			"webdevelopment"
		],
		"category": "Web Development",
		"body": "I have been struggling to implement multiple filters in a single column in Grid.Mvc tool. I have solved this by altering the code and updating the custom widget.\r\n**Note:** The WithMultipleFilters() option will not help you in this. That option enables multiple filters on different columns. To have multiple filters in the same column you need to update the way filtering works in the tool itself.\r\n\r\nI have used a list of checkboxes and any or all of the elements selected in this checkbox list will be used for filtering the column values.\r\n\r\nYou can find the code in my fork of the official Grid.Mvc repo at below link:\r\n<a href=\"https:\/\/github.com\/HarvestingClouds\/Grid.Mvc\" target=\"_blank\">Fork of Grid.Mvc repo with Advance Filters<\/a>\r\n\r\nI have also created a pull request for the same so that more people get benefit from this if they refer the master branch of the main repo.\r\n\r\n### What are the changes I have done?\r\nI have made changes to two files:\r\n\r\n 1. **DefaultColumnFilter.cs** file in \"**GridMvc**\" class library project under the Filters folder. I have updated the GetFilterExpression method to create multiple expressions based on the pipeline character in filter values.\r\n 2. **gridmvc.customwidgets.js** file in \"**GridMvc.Site**\" web application project\r\n\r\nBoth of these paths are shown below:\r\nLocation of DefaultColumnFilter.cs:\r\n![DefaultColumnFilter.cs](http:\/\/HarvestingClouds.com\/images\/146173541957204ffb99678.png \"DefaultColumnFilter.cs\")\r\n\r\nLocation of gridmvc.customwidgets.js:\r\n![gridmvc.customwidgets.js](http:\/\/HarvestingClouds.com\/images\/146173543057205006529e6.png \"gridmvc.customwidgets.js\")\r\n\r\nHow the end result look like:\r\n![Checkbox Filtering](http:\/\/HarvestingClouds.com\/images\/14617354255720500171fe7.png \"Checkbox Filtering\")\r\n\r\nYou can directly use the code if you want. Just honor the license of the original author.\r\n\r\nLet me know in the comments below if you have any doubts and I will be happy to address them.",
		"addpost": "addpost",
		"dated": "Apr 12, 2016",
		"slug": "multiple-values-in-gridmvc-single-column-filter-via-checkboxes-with-code-sample",
		"categoryslug": "web-development",
		"status": "publised",
		"summary": "\n<p>I have been struggling to implement multiple filters in a single column in Grid.Mvc tool. I have solved this by altering the code and updating the custom widget.\n<strong>Note:<\/strong> The WithMultipleFilters() option will not help you in this. That option enables multiple filters on different co...<\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Getting Started - Azure Site Recovery (ASR) In New Azure Portal",
		"postDate": "09-04-2016",
		"tags": [
			"arm",
			"azure"
		],
		"category": "Azure",
		"body": "Azure Site Recovery or ASR is now available in the new Azure Resource Manager or ARM portal (codename Ibiza) with modern user interface. It is in preview at this stage. But it is production ready for all the Hyper-V related scenarios.\r\n**Your older Vaults (created via Classic ASM Azure Portal) will not be available in ASR preview feature.**\r\n\r\n### What are the new features\r\n\r\nThe new features include:\r\n\r\n* All the goodness of Azure Resource Manager in ASR\r\n* Lean experience for various ASR scenarios\r\n* Enhancements to the specific Site Recovery scenarios\r\n\r\n### Lets take a quick look at some of these.\r\n\r\nIf you Browse and search for \"Recovery\" you get Recovery Services Vaults as Preview feature.\r\n![Browse and Search](http:\/\/HarvestingClouds.com\/images\/14617358075720517f78904.png \"Browse and Search\")\r\n\r\nClicking on it will open up the blade for \"Recovery Services valuts\". Notice that Microsoft has PREVIEW text in this.\r\n![alt text](http:\/\/HarvestingClouds.com\/images\/1461735702572051161683f.png \"ASR Vault\")\r\n\r\nClicking on the Add button brings up the ASR vault creation blade. Notice the locations available for vault creation here.\r\n![Vault Creation](http:\/\/HarvestingClouds.com\/images\/14617359385720520210878.png \"Vault Creation\")\r\n\r\nAfter you hit create the Vault gets deployed really quickly. I tested for East US location and it was created in under 10 secs.\r\nRefresh to view your newly created vault. Click on it to open the NEW ASR Vault features. Notice that the Backup feature is also there in the ASR vault now.\r\n![New Vault](http:\/\/HarvestingClouds.com\/images\/1461735907572051e31549a.png \"New Vault\")\r\n\r\nTo find the options for replication go to Settings -> Getting Started section -> Site Recovery -> Follow Wizard.\r\n![New Site Recovery Wizard](http:\/\/HarvestingClouds.com\/images\/1461735869572051bd2d6fa.png \"New Site Recovery Wizard\")\r\n\r\nThe Scenario Types available are only two. But all the scenarios are covered here:\r\n\r\n* From my site to Azure\r\n* From my site to another site\r\n\r\nBased on the scenario you select you are asked for different options. The options for Virtualization\/Management Server type for \"From my site to Azure\" are:\r\n\r\n* VMM\r\n* Stand alone Hyper-V hosts\r\n* vCenter\r\n* Physical machines (not virtualized)\r\n![Creation Options](http:\/\/HarvestingClouds.com\/images\/14617358385720519e578ba.png \"Creation Options\")\r\n\r\n### Backup in ASR vault\r\nAnother feature is creation of Backups from the same vault. Click on the + icon for Backup in the Vault main blade and then follow the wizard for the preview feature.\r\n![Backup In ASR](http:\/\/HarvestingClouds.com\/images\/14617357575720514d5d1d8.png \"Backup In ASR\")\r\nNotice in the screenshot above that the backup types available are:\r\n\r\n* Azure virtual machine backup\r\n* File Folder backup\r\n* System Center Data Protection Manager\r\n\r\nSelecting each option provides you with details for next steps. You can then create a backup policy and configure Items to backup.\r\n\r\nGive these features a try and let us know in comments below how you find the new features.\r\nHappy Exploring!",
		"addpost": "addpost",
		"dated": "Apr 09, 2016",
		"slug": "getting-started-azure-site-recovery-asr-in-new-azure-portal",
		"categoryslug": "azure",
		"status": "publised",
		"summary": "\n<p>Azure Site Recovery or ASR is now available in the new Azure Resource Manager or ARM portal (codename Ibiza) with modern user interface. It is in preview at this stage. But it is production ready for all the Hyper-V related scenarios.\n<strong>Your older Vaults (created via Classic ASM Azure Porta...<\/strong><\/p>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Coming Soon - Windows 10 Anniversary Update",
		"postDate": "08-04-2016",
		"tags": [
			"announcement",
			"windows10"
		],
		"category": "General",
		"body": "Windows 10 Anniversary Update is coming this summary. It will be available for free download for the following devices (which is almost every device):\r\n\r\n* PCs\r\n* Tablets\r\n* Phones\r\n* Xbox One\r\n* Microsoft HoloLens\r\n* IoT\r\n\r\n## What this means to you:\r\n\r\n* Improved Biometric Security\r\n* Microsoft Edge browser\r\n* Windows Ink (where just one click of pen will bring up all the gamut available for use with your Pen device)\r\n* Universal Windows Platform or UWP apps are coming to XBox through a Unified Windows Store. Also if you own a XBox you will be able to turn it into a dev box and do development with it\r\n* Various improvements to Cortana\r\n\r\n<a href=\"https:\/\/www.microsoft.com\/en-us\/windows\/upcoming-features\" target=\"_blank\">Check out more details here<\/a>\r\n",
		"addpost": "addpost",
		"dated": "Apr 08, 2016",
		"slug": "coming-soon-windows-10-anniversary-update",
		"categoryslug": "general",
		"status": "publised",
		"summary": "\n<p>Windows 10 Anniversary Update is coming this summary. It will be available for free download for the following devices (which is almost every device):<\/p>\n<ul><li>PCs<\/li>\n<li>Tablets<\/li>\n<li>Phones<\/li>\n<li>Xbox One<\/li>\n<li>Microsoft HoloLens<\/li>\n<li>IoT<\/li>\n<\/ul><h2>What this means to you...<\/h2>\n",
		"prevStatus": "publised"
	},
	{
		"author": "@20aman",
		"title": "Introducing Harvesting Clouds",
		"postDate": "04-01-2016",
		"tags": [
			"general"
		],
		"category": "General",
		"body": "Harvesting Clouds is a blog about all things Cloud. Be it Private Cloud or Public Cloud, I will try to cover various aspects of both.\r\n\r\n### Private Cloud\r\n\r\nMy key areas of interest in Private Cloud include the following:\r\n\r\n* PowerShell Scripting\r\n* Windows Azure Pack or WAP\r\n* Service Management Automation or SMA\r\n* Azure Stack\r\n* System Center Orchestrator\r\n* System Center VMM and other products like Service Manager, Ops Mgr, etc.\r\n\r\n### Public Cloud\r\n\r\nIn addition to the Private Cloud the areas of interest in Public Cloud are:\r\n\r\n* Microsoft Azure and Amazon Web Services - both IaaS and PaaS\r\n* Azure Automation\r\n* Desired State Configurations\r\n* Application Insights\r\n* Azure Web Apps\r\n* Web APIs\r\n* Azure Site Recovery and Backup\r\n* Migrations from Private to Public Clouds\r\n\r\n### Common Areas & Best of both worlds\r\n\r\nI have also been involved in creating Hybrid clouds leveraging the best of both worlds. I will try to share my knowledge on this with you. The key aspects in this area are:\r\n* Building Hybrid Solutions\r\n* Developing Web or Desktop Applications targetting either or both the clouds (using MVC, Dot Net)\r\n* Using TFS Online, Visual Studio, GitHub to better collaborate and work in an automated fashion\r\n* Release Manager to automate your release workflows\r\n\r\n### Primary Focus\r\n\r\nAs you must have guessed by now, the primary focus for this blog will be Microsoft Technologies. We will also explore beyond this and will be talking about various emerging open source technologies and the new Better Together world with the amalgamation of various technologies in one solution.\r\n\r\nI invite to take this journey with me!\r\nKeep learning!\r\n",
		"addpost": "addpost",
		"dated": "Apr 01, 2016",
		"slug": "introducing-harvesting-clouds",
		"categoryslug": "general",
		"status": "publised",
		"summary": "\n<p>Harvesting Clouds is a blog about all things Cloud. Be it Private Cloud or Public Cloud, I will try to cover various aspects of both.<\/p>\n<h3>Private Cloud<\/h3>\n<p>My key areas of interest in Private Cloud include the following:<\/p>\n<ul><li>PowerShell Scripting<\/li>\n<li>Windows Azure Pack or WAP...<\/li><\/ul>\n",
		"prevStatus": "publised"
	}
]